[
  {
    "url": "https://www.congress.gov.ph/media/press-releases/view/?content=9422&title=OCTA+survey+reflects+public+support+for+House+reforms+%E2%80%94+Speaker+Romualdez",
    "timestamp": 1753854790839,
    "data": {
      "id": "C1",
      "title": "OCTA survey reflects public support for House reforms — Speaker Romualdez",
      "href": "https://www.congress.gov.ph/media/press-releases/view/?content=9422&title=OCTA+survey+reflects+public+support+for+House+reforms+%E2%80%94+Speaker+Romualdez",
      "content": {
        "datetime": "2025-07-30 12:48 PM",
        "article": "Office of Speaker Ferdinand Martin G. Romualdez\nReference: Ryan Ponce Pacpaco \n\n“I welcome the results of the latest OCTA Tugon ng Masa survey with gratitude and a clear sense of responsibility.”\n\nThe increase in both my trust rating (now at 57%) and performance rating (up to 59%) is an encouraging sign that the reforms we’ve been working on in the House of Representatives—particularly on transparency, budget integrity, and service delivery—are gaining public support.\n\nThese gains are broad-based, cutting across all major regions and socioeconomic groups. That tells me one thing: people are paying attention. They want honest leadership and tangible results.\n\nWe will continue to work quietly but decisively. There is still much to be done to ensure that public funds are spent efficiently, that infrastructure projects are free from corruption, and that basic services reach those who need them most.\n\nThis is not a victory lap. It’s a reminder to stay focused, stay grounded, and stay accountable."
      },
      "PDF": null
    }
  },
  {
    "url": "https://www.congress.gov.ph/media/press-releases/view/?content=9421&title=House+elects+Appropriations%2C+Quad+Comm%2C+other+key+panel+chairs",
    "timestamp": 1753854797665,
    "data": {
      "id": "C1",
      "title": "House elects Appropriations, Quad Comm, other key panel chairs",
      "href": "https://www.congress.gov.ph/media/press-releases/view/?content=9421&title=House+elects+Appropriations%2C+Quad+Comm%2C+other+key+panel+chairs",
      "content": {
        "datetime": "2025-07-29 11:37 PM",
        "article": "Office of Speaker Ferdinand Martin G. Romualdez\nReference: Ryan Ponce Pacpaco \n\nTHE House of Representatives on Tuesday elected new leaders to several key committees—including the powerful Appropriations, Rules, and Quad Comm—in a major organization aimed at further strengthening legislative oversight, fiscal discipline and coordination of House proceedings in the 20th Congress under the leadership of Speaker Ferdinand Martin G. Romualdez.\n\nHarvard-educated Nueva Ecija 1st District Rep. Mikaela Angela “Mika” Suansing was chosen to chair the Committee on Appropriations, one of the most influential panels in the House with jurisdiction over the national budget. \n\nSuansing, one of the leaders of the House Young Guns, will be assisted by Bataan 2nd District Rep. Albert Garcia, who was elected senior vice chair. \n\nHer leadership comes at a critical time, with the House set to begin deliberations once the proposed 2026 national budget is submitted by the Executive branch. \n\nSpeaker Romualdez has been a strong advocate for opening to public the traditionally closed bicameral conference committee (bicam) and allow members of civil society to observe.\n\nThe Quad Comm—composed of the Committees on Dangerous Drugs, Public Order and Safety, Human Rights and Public Accounts—plays a central role in major House investigations into illegal activities, human rights violations, and other serious threats to public safety and good governance.\n\nBukidnon 2nd District Rep. Jonathan Keith Flores was elected chair of the Committee on Dangerous Drugs, while Manila 2nd District Rep. Rolando Valeriano will now lead the Committee on Public Order and Safety. \n\nManila 6th District Rep. Bienvenido “Benny” Abante Jr. was retained as chair of the Committee on Human Rights. The House has yet to elect a new chair for the Committee on Public Accounts.\n\nDavao de Oro 1st District Rep. Maria Carmen Zamora was elected chair of the Committee on Accounts.\n\nThe chamber also elected Marikina 2nd District Rep. Miro Quimbo as chair of the Committee on Ways and Means, which handles tax and revenue legislation, with Manila 1st District Rep. Ernesto “Ernix” Dionisio Jr. as senior vice chair. \n\nManila 3rd District Rep. Joel Chua was retained as chair of the Committee on Good Government and Public Accountability, while Cagayan de Oro 1st District Rep. Lordan Suan now heads the Committee on Public Information.\n\nTo support Majority Leader and Rules Committee chair Ilocos Norte 1st District Rep. Ferdinand Alexander “Sandro” Marcos, the House elected Iloilo 3rd District Rep. Lorenz Defensor as senior deputy majority leader.\n\nThe newly elected deputy majority leaders are Reps. Julienne “Jam” Baronda (Iloilo City, Lone District), Marlyn Primicias-Agabas (Pangasinan, 6th District), Zia Alonto Adiong (Lanao del Sur, 1st District), Patrick Michael Vargas (Quezon City, 5th District), Ma. Alana Samantha Santos (Cotabato, 3rd District), Ernesto Dionisio Jr. (Manila, 1st District), Jeyzel Victoria Yu (Zamboanga del Sur, 2nd District), Arnan Panaligan (Oriental Mindoro, 1st District), Alyssa Michaela “Mica” Gonzales (Pampanga, 3rd District), Marie Bernadette Escudero (Sorsogon, 1st District), Ivan Howard Guintu (Capiz, 1st District), Wowo Fortes (Sorsogon, 2nd District), Adrian Jay Advincula (Cavite, 3rd District), Anna Victoria Veloso-Tuazon (Leyte, 3rd District), Crispin Diego Remulla (Cavite, 7th District), Vincenzo Renato Luigi Villafuerte (Camarines Sur, 2nd District), Jose “Bong” Teves Jr. (TGP Party-list), Munir Arbison Jr. (KAPUSO PM Party-list), and Ramon Rodrigo “Rodge” Gutierrez (1-RIDER Party-list).\n\nThe new assistant majority leaders are Reps. Bai Dimple Mastura (Maguindanao del Norte, Lone District), Rhea Mae Gullas (Cebu, 1st District), Daphne Lagon (Cebu, 6th District), Roberto “Pinpin” Uy Jr. (Zamboanga del Norte, 1st District), Agatha Paula Aguilar Cruz (Bulacan, 5th District), De Carlo Uy (Davao del Norte, 1st District), Leonel Ceniza (Davao de Oro, 2nd District), Ronald Singson (Ilocos Sur, 1st District), Mark Anthony Santos (Las Piñas City, Lone District), King Collantes (Batangas, 3rd District), Patricia Calderon (Cebu, 7th District), Juan Carlos “Arjo” Atayde (Quezon City, 1st District), Alexandria Gonzales (Mandaluyong City, Lone District), John Geesnell “Baba” Yap II (Bohol, 1st District), Francisco “Kiko” Barzaga (Cavite, 4th District), Ralph Wendel Tulfo (Quezon City, 2nd District), Esmael Mangudadatu (Maguindanao del Sur, Lone District), Bella Vanessa Suansing (Sultan Kudarat, 2nd District), Javier Miguel Lopez Benitez (Negros Occidental, 3rd District), Katrina Reiko Chua-Tai (Zamboanga City, 1st District), Jorge Daniel Bocobo (Taguig City, Lone District – 2nd Councilor District), Ryan Recto (Batangas, 6th District), James “Jojo” Ang (USWAG ILONGGO Party-list), Brian Poe-Llamanzares (FPJ PANDAY BAYANIHAN Party-list), and Johanne Monich Bautista (TRABAHO Party-list).\n\nEarlier in the day, Speaker Romualdez administered the oath of office to Majority Leader Marcos; and nine deputy speakers, namely Janette Garin (Iloilo, 1st District), Yasser Alonto Balindong (Lanao del Sur, 2nd District), Francisco Paolo Ortega V (La Union, 1st District), Jefferson Khonghun (Zambales, 1st District), Kristine Singson-Meehan (Ilocos Sur, 2nd District), Ronaldo Puno (Antipolo City, 1st District), Faustino Dy III (Isabela, 6th District), Ferjenel Biron (Iloilo, 4th District) and Raymond Democrito Mendoza (TUCP Party-list).\n\nSpeaker Romualdez also administered the oath of Secretary General Reginald Velasco and Sergeant-at-Arms retired Police Maj. Gen. Napoleon Taas."
      },
      "PDF": null
    }
  },
  {
    "url": "https://www.congress.gov.ph/media/press-releases/view/?content=9420&title=House+to+prioritize+food%2C+jobs%2C+education%2C+health+in+20th+Congress%3A+Speaker+Romualdez+vows+to+legislate+for+the+struggling+99%25%2C+not+the+top+1%25",
    "timestamp": 1753854805059,
    "data": {
      "id": "C1",
      "title": "House to prioritize food, jobs, education, health in 20th Congress: Speaker Romualdez vows to legislate for the struggling 99%, not the top 1%",
      "href": "https://www.congress.gov.ph/media/press-releases/view/?content=9420&title=House+to+prioritize+food%2C+jobs%2C+education%2C+health+in+20th+Congress%3A+Speaker+Romualdez+vows+to+legislate+for+the+struggling+99%25%2C+not+the+top+1%25",
      "content": {
        "datetime": "2025-07-29 04:35 PM",
        "article": "Office of Speaker Ferdinand Martin G. Romualdez\nReference: Ryan Ponce Pacpaco \n\nTHE House of Representatives will center its legislative work on the urgent needs of ordinary Filipinos as it opens the 20th Congress, with a focus on food, employment, education and public health.\n\n“We will build an economy not just for the top 1%, but for the struggling 99% — an economy where ordinary people don’t just survive, they succeed,” Speaker Ferdinand Martin G. Romualdez said in a speech during the resumption of session Tuesday. \n\nSpeaker Romualdez emphasized that the goal of the House is to bring government closer to the people by aligning its agenda with the priorities laid out by President Ferdinand R. Marcos Jr. in his recent State of the Nation Address (SONA). \n\n“Ang Kongreso ay hindi dapat maging tahanan ng mga pribilehiyo, kundi sandigan ng pangkaraniwang Pilipino,” Speaker Romualdez declared.\n\nHe then laid out key areas that the chamber would prioritize in the new session, starting with food security. \n\nSpeaker Romualdez said the House would pass the Rice Industry and Consumer Empowerment Act or RICE Act to ensure a stable supply of affordable rice while protecting farmers from exploitation. \n\nHe added that smuggling, hoarding and price manipulation must be eliminated through better law enforcement and agricultural reforms. \n\n“Sa bayan ng masisipag na magsasaka, walang karapatang magutom ang mamamayan,” Speaker Romualdez said.\n\nHe also announced plans to expand irrigation and post-harvest infrastructure, alongside efforts to modernize farming to make agriculture more profitable. \n\nThe Speaker said the House would institutionalize the Walang Gutom Program in the 2026 national budget through monthly electronic food credits for vulnerable families.\n\nOn employment, Speaker Romualdez said legislation must generate dignified and sustainable work, particularly through support for small businesses, TESDA programs and access to capital. \n\nHe also backed the President’s push to develop industries like automotive, electronics, biotechnology and construction to create long-term jobs. \n\n“Ang trabaho ay hindi lamang kabuhayan. Kakambal nito ang dangal, ito ang kinabukasan,” he said.\n\nSpeaker Romualdez stressed that the House would build an economy that uplifts the 99 percent. He said lawmakers must resist systems that reward only the elite and instead ensure that ordinary workers and families benefit from economic growth.\n\nIn education, he committed to bridging the gap for underserved learners by passing the Last Mile Schools Act and amending the E-GASTPE Law. \n\nThe Speaker also vowed to expand the ARAL Program and strengthen mental health support in schools. \n\n“Ang edukasyon ay hindi dapat premyo sa may kaya, kundi karapatan ng bawat bata,” he noted.\n\nOn health care, Speaker Romualdez reiterated the House’s goal to achieve zero billing and eliminate out-of-pocket costs in all government hospitals. \n\nHe said this would be matched by the deployment of more health workers in remote areas and improved access to essential medicine. \n\n“Ang tunay na malasakit ay nasusukat sa oras ng pangangailangan. Sa ospital ng gobyerno, walang dapat maghirap para lang mabuhay,” he said.\n\nSpeaker Romualdez also identified peace and order as a central priority, saying that laws must guarantee not only the absence of conflict but also the presence of justice and opportunity. \n\nHe said this included support for local peace and order councils, law enforcement and national electrification. \n\n“Kapag may kapayapaan, may kinabukasang tiyak,” he said.\n\nHe committed to fast-tracking defense modernization and disaster resilience, citing the need to protect lives, not just territory. \n\nSpeaker Romualdez also echoed the President’s call for full household electrification by 2028 and promised the House would allocate the resources needed to meet that target.\n\nOn governance, the Speaker called for a shift toward a more responsive bureaucracy. He said the House would pass laws to digitalize services, eliminate red tape and professionalize public service. \n\n“Hindi na sapat ang ‘puwede na.’ Ang kailangan ng Pilipino: mabilis, maayos at may malasakit na serbisyo,” he said.\n\nSpeaker Romualdez urged lawmakers to make this Congress a turning point, not only in lawmaking but in restoring faith in government. \n\n“Let the 20th Congress be a turning point — not just in the laws we pass, but in the lives we changed,” he said.\n\nHe added that the chamber must not settle for laws that look good on paper but fail to deliver impact. \n\n“Hindi sapat ang mga batas na mahusay. Kailangang ito ay may puso. Hindi sapat ang batas na maganda sa papel — dapat ito’y may saysay sa buhay,” he said.\n\nSpeaker Romualdez ended his address with a call to action, urging his colleagues to legislate with compassion and to earn the public’s trust through meaningful reforms. \n\n“We are the House of the People. Let us be remembered for being worthy of that name,” he said."
      },
      "PDF": null
    }
  },
  {
    "url": "https://www.congress.gov.ph/media/press-releases/view/?content=9419&title=Speaker+Romualdez+unveils+landmark+budget+reforms%3A+Opens+bicam%2C+launches+infrastructure+review",
    "timestamp": 1753854811962,
    "data": {
      "id": "C1",
      "title": "Speaker Romualdez unveils landmark budget reforms: Opens bicam, launches infrastructure review",
      "href": "https://www.congress.gov.ph/media/press-releases/view/?content=9419&title=Speaker+Romualdez+unveils+landmark+budget+reforms%3A+Opens+bicam%2C+launches+infrastructure+review",
      "content": {
        "datetime": "2025-07-29 03:54 PM",
        "article": "Office of Speaker Ferdinand Martin G. Romualdez\nReference: Ryan Ponce Pacpaco \n\nSPEAKER Ferdinand Martin G. Romualdez on Tuesday declared a new era of transparency and public accountability in government budgeting, unveiling historic reforms that include opening the traditionally closed bicameral conference committee (bicam) to civil society observers.\n\nSpeaking before his colleagues at the plenary session of the 20th Congress, Speaker Romualdez said the House of Representatives will take the lead in reshaping how government funds are spent and safeguarded.\n\n“We will seek to open the bicameral budget conference to civil society observers — a historic first. Because transparency is not just a value; it is a weapon against corruption. This reform will not only earn public trust but will also strengthen inclusive and participatory governance,” Speaker Romualdez said. \n\nHe emphasized that public watchdogs will be part of all stages of budget deliberation, from committee hearings to final plenary debates.\n\n“We will allow the participation of watchdogs in all levels of budget deliberation — from committee hearings to plenary sessions,” Speaker Romualdez said. \n\n“Hindi lang natin bubuksan ang Kongreso para sa mga mamamayan na magbabantay ng badyet. Mapapanood din ang lahat ng diskusyon sa telebisyon at mga social media platforms,” he said. \n\nSpeaker Romualdez also announced a firm crackdown on inefficiency, fund wastage, and bureaucratic neglect, committing to more aggressive oversight by Congress.\n\n“We will strengthen our oversight functions and conduct mid-year performance reviews of agencies. Those who delay, hoard, or waste public funds will be called out,” Speaker Romualdez said. \n\nHe warned that budget allocations will no longer be automatically granted but must be performance-based. “Departments must earn their budgets — not just request them.”\n\n“Ang bawat pisong ninanakaw ay isang pasyenteng di nagamot, isang estudyanteng ‘di nakapag-aral, at isang proyektong di natapos,”Speaker  Romualdez said. \n\nThe Speaker responded to President Ferdinand R. Marcos Jr.’s call to confront corruption in public service, affirming his full support for the President’s reform agenda while asserting the House’s independent role in institutional accountability.\n\n“We heard the President’s SONA. We take to heart his call — his frustration, even — about the lingering shadow of corruption in our institutions.”\n\n“As Speaker, I share his concern. And I accept his challenge — not with defensiveness, but with determination,” Speaker Romualdez said. \n\nSpeaker Romualdez announced that the House will launch a comprehensive congressional review of infrastructure projects and fund implementation to identify systemic weaknesses and policy gaps.\n\n“That is why the House of Representatives will launch a comprehensive congressional review of infrastructure projects and fund implementation,” Speaker Romualdez said.\n\nHe said the review will focus on:\n\n“Ghost projects, bloated contracts, chronic underspending, and abuse of discretion in fund realignment and procurement,” he said. \n\nSpeaker Romualdez also committed to introducing legislative proposals that will institutionalize public scrutiny, real-time monitoring, and strong accountability standards across all agencies and contractors.\n\n“We will propose new legislation to require:\n• Real-time public reporting of project progress and fund use,\n• Mandatory compliance with performance standards by contractors and agencies, and\n• A national infrastructure audit framework to prevent misuse of public funds,” he said. \n\n“The House will take the lead in shaping stronger public accountability mechanisms — because good governance is our duty, not just our defense,” Speaker Romualdez said. \n\nHe ended the segment with a clear and resolute reminder of Congress’s moral obligation to the people.\n\n“Ang kaban ng bayan ay hindi dapat ninanakaw, hindi dapat sinasayang. Ito ay para sa mamamayan — bawat sentimo, bawat proyekto, bawat serbisyo,” Speaker Romualdez said. “We are not here to cover up. We are here to clean up.”"
      },
      "PDF": null
    }
  },
  {
    "url": "https://www.congress.gov.ph/media/press-releases/view/?content=9418&title=SPEAKER%E2%80%99S+OFFICE+STATEMENT+On+allegations+of+pork+barrel%2C+post-appropriation+control%2C+and+small+committee+mechanism",
    "timestamp": 1753854818837,
    "data": {
      "id": "C1",
      "title": "SPEAKER’S OFFICE STATEMENT On allegations of pork barrel, post-appropriation control, and small committee mechanism",
      "href": "https://www.congress.gov.ph/media/press-releases/view/?content=9418&title=SPEAKER%E2%80%99S+OFFICE+STATEMENT+On+allegations+of+pork+barrel%2C+post-appropriation+control%2C+and+small+committee+mechanism",
      "content": {
        "datetime": "2025-07-29 02:32 PM",
        "article": "ATTY. PRINCESS ABANTE\nSPOKESPERSON, HOUSE OF REPRESENTATIVES\n\nThe Office of the Speaker firmly denies the baseless accusation that it exercises post-appropriation control over programs such as AICS, AKAP, TUPAD, and MAIP. These programs are implemented solely by executive agencies such as the DSWD, DOLE, and DOH. These agencies retain full authority over the approval, funding, and implementation of their respective programs, in accordance with law and internal procedures.\n\nLike all congressional offices, the Office of the Speaker may issue endorsements or referrals in response to constituent requests from lawmakers or local leaders. These are strictly facilitative and do not guarantee or influence approval. Final decisions rest entirely with the implementing agencies, which assess each request based on program guidelines, fund availability, and internal controls.\n\nTo allege otherwise is to misrepresent the law and institutional practice. The Supreme Court’s landmark ruling in Belgica v. Executive Secretary (PDAF case) prohibits legislators from exercising post-enactment discretion over public funds. The House of Representatives, under Speaker Ferdinand Martin G. Romualdez, fully upholds this principle.\n\nAs to the issue of the small committee used during the budget process, this mechanism is a longstanding parliamentary practice that allows the efficient consolidation of individual amendments after plenary debates. It has been used across many Congresses, including those in which Congressman Toby Tiangco held leadership roles—and never objected to its use.\n\nThe small committee does not override or replace the plenary. Its outputs are reported and become part of the final GAB. To characterize it as a “secret meeting” is misleading and undermines the institutional memory and processes of the House.\n\nNonetheless, if Congressman Tiangco believes the rules must be changed, he is free—and encouraged—to raise the matter formally before the plenary. The Speaker will respect the decision of the majority. If the House decides, through its rules and votes, to revise the budget process or abolish the small committee, then so be it. That is the democratic process in action.\n\nSpeaker Romualdez is not only open to reform—he is leading it. Among the budget reforms he is actively championing are:\n\t•\tOpening the bicameral conference committee to public scrutiny,\n\t•\tAllowing civil society participation as independent watchdogs in deliberations,\n\t•\tEliminating inefficiencies and duplication in fund releases, and\n\t•\tStrengthening congressional oversight while respecting the constitutional separation of powers.\n\nThese reforms will be outlined in full in his address to the plenary.\n\nLet us not allow political theatrics to distract from the real work at hand: ensuring that every peso in the national budget is spent transparently, efficiently, and in service of the Filipino people. This is the mandate of the House, and this is the commitment of Speaker Romualdez."
      },
      "PDF": null
    }
  },
  {
    "url": "https://www.congress.gov.ph/media/press-releases/view/?content=9417&title=Speaker+Romualdez+backs+full+budget+overhaul%3A+Every+centavo+must+count",
    "timestamp": 1753854825759,
    "data": {
      "id": "C1",
      "title": "Speaker Romualdez backs full budget overhaul: Every centavo must count",
      "href": "https://www.congress.gov.ph/media/press-releases/view/?content=9417&title=Speaker+Romualdez+backs+full+budget+overhaul%3A+Every+centavo+must+count",
      "content": {
        "datetime": "2025-07-28 06:47 PM",
        "article": "Office of Speaker Ferdinand Martin G. Romualdez\nReference: Ryan Ponce Pacpaco \n\nSPEAKER FERDINAND MARTIN G. ROMUALDEZ\nAcceptance Speech\n20th Congress of the Republic of the Philippines\nPlenary Hall | July 28, 2025\n\nHonorable Members of the House of Representatives,\nDistinguished Guests,\nLadies and Gentlemen:\n\nWith humility in my heart and a deep sense of duty, I rise today to accept the renewed trust you have given me to serve once again as Speaker of the House of Representatives.\n\nThis is an honor I embrace with full awareness of the responsibility it entails — not only to this esteemed institution, but most importantly, to the Filipino people we have all sworn to serve.\n\n“Ang tiwala ay hindi gantimpala, kundi panibagong hamon. At bawat hamon ay pagkakataon para maglingkod nang mas tapat, mas totoo, at mas buo.”\n\nAs we open the 20th Congress, we build upon the foundations laid in the 19th — advancing reforms that bring government closer to the people, and restoring trust in this Chamber as the true House of the People.\n\nWe convene at a time that demands unity of purpose, clarity of vision, and courage of conviction. We are not here to preserve power, but to pursue progress. Not to serve ourselves, but to uplift the lives of our fellow citizens.\n\nAnd today, as we formally begin this new chapter, we do so amid a development that once again calls us to reflect on our sacred constitutional duty — the Supreme Court’s decision on the impeachment case filed against the Vice President.\n\nLet me say this with the utmost respect: The Supreme Court has spoken, and we recognize its decision. But let it never be said that the House of the People bowed in silence.\n\nAt the same time, we draw a line: the power to initiate impeachment is the exclusive domain of this Chamber. It flows from the people’s will and rests solely on the clear language of the Constitution. It is neither granted nor guided by any outside institution.\n\nThe Court may close a case, but it cannot close a cause. The pursuit of accountability is not a moment — it is a mandate.\n\nWe are not moved by personalities, but by principles. We are not driven by vendetta, but by vigilance. Our goal has never been to destroy — only to demand the truth.\n\nWhen institutions falter, the House of the People always stands firm. When others fear the storm, your House holds the line.\n\nAnd as your Speaker, I will be here — not just to preside, but to protect. \n\n“Hindi ko kayo iiwan sa gitna ng unos. Gaya ng ama ng tahanan na hindi natutulog kapag may bagyong papasok, babantayan ko ang ating Kapulungan. Sisiguraduhin kong walang bubong ang babagsak, walang pader ang magigiba, at walang miyembro ang mapapabayaan.”\n\n“Kahit anong bagyo at baha, hindi tayo susuko. Titindig tayo at hindi panghihinaan ng loob. Kasama ninyo ako sa pagsalubong ng bagong araw.”\n\nOur work as legislators is both constitutional and moral. It is through the laws we pass — and the accountability we uphold — that we protect rights, promote equity, and shape the future of our democracy.\n\n“Bawat batas na ating ipinapasa ay salamin ng pangarap ng bawat Pilipino — mula sa estudyanteng nangangarap, sa manggagawang lumalaban, hanggang sa pamilyang patuloy na umaasa.”\n\nTo my fellow Representatives — thank you for your continued support and your unwavering commitment to public service. To those who have offered different views, I thank you as well. Your voices enrich our debates and fortify our democracy.\n\n“Hindi kahinaan ang pagkakaiba ng opinyon. Sa Kongresong may respeto, ito’y pinagmumulan ng talino, tapang, at tunay na pagbabago.”\n\nAs your Speaker, I reaffirm our common commitment: to be a House that is transparent in conduct, firm in principle, and responsive to the needs of our people. We shall lead with competence, legislate with compassion, and govern with integrity.\n\nI thank His Excellency, President Ferdinand R. Marcos Jr., for his continued trust in the leadership of this Chamber. The House of Representatives stands ready to be your reliable partner in building a Bagong Pilipinas — a nation that is inclusive, resilient, and grounded in justice and opportunity.\n\nAnd to our beloved Filipino people: you are not just our mandate. You are our mission.\n\nThis House is your voice. And we are ready — ready to speak up, stand up, and act in your name and for your future.\n\n“Ang Kapulungan na ito ay boses ng taumbayan. At kung boses ng taumbayan ang ating dala, tungkulin nating ito’y gamitin — para sa kanilang karapatan, kabuhayan, at kinabukasan.”\n\nLet this be a Congress remembered not only for the laws we passed, but for the lives we changed. Not only for the battles we fought, but for the truth we stood for.\n\nThe judgment that matters most is not that of any single court — but of history, and of the people we serve.\n\nMabuhay ang Kapulungan ng mga Kinatawan.\n\nMabuhay ang sambayanang Pilipino.\n\nMaraming salamat po.\nSPEAKER Ferdinand Martin G. Romualdez on Monday expressed full support for President Ferdinand R. Marcos Jr.’s call to realign national priorities with the everyday needs of Filipinos, vowing to champion budget reforms, an open bicam and targeted investments in agriculture, health and job creation.\n\n“The President’s message was clear: make government work better for the people. As Speaker, I am committed to making sure the budget reflects that – every centavo must go where it’s needed most,” Speaker Romualdez said.\n\nThe Speaker said the House leadership is prepared to act decisively on long-needed structural changes to the national budget process, and that these reforms must prioritize accountability, eliminate inefficiencies and ensure that spending directly addresses the needs of Filipino families.\n\n“This is not just about numbers, it’s about making sure families feel the impact of every peso we allocate,” he added.\n\nSpeaker Romualdez also backed growing calls for transparency in budget deliberations, particularly in the bicameral conference committee, which reconciles Senate and House versions of the national budget.\n\n“No backroom haggling. The people have every right to know how their money is being spent. If we want trust, we have to earn it, starting with an open bicam,” the Speaker stressed.\n\nIn line with the President’s priorities, Speaker Romualdez committed to channeling funds into high-impact sectors such as agriculture, public health and job creation, especially for vulnerable and underserved communities.\n\n“We need to put food on the table, ensure no family is crushed by hospital bills, and create jobs that restore dignity and hope. These are not abstract goals, they are urgent, real and long overdue,” he said.\n\nSpeaker Romualdez assured the public that the House will treat the proposed 2026 national budget with both urgency and seriousness, conscious of the pressing challenges confronting the country.\n\n“No delay, no drama. The House will do its job with focus and compassion. Because at the end of the day, that budget isn’t about institutions. It’s about lives,” Speaker Romualdez said.\n\nHe added that under his stewardship, the House will serve as a reliable and responsible partner in delivering genuine reform and people-centered legislation.\n\n“We will legislate with purpose. Not for headlines, but for households. Not for applause, but for impact. That’s what this moment calls for, and that’s what the people deserve,” Speaker Romualdez stressed."
      },
      "PDF": null
    }
  },
  {
    "url": "https://www.congress.gov.ph/media/press-releases/view/?content=9416&title=Acceptance+Speech+of+SPEAKER+FERDINAND+MARTIN+G.+ROMUALDEZ",
    "timestamp": 1753854833125,
    "data": {
      "id": "C1",
      "title": "Acceptance Speech of SPEAKER FERDINAND MARTIN G. ROMUALDEZ",
      "href": "https://www.congress.gov.ph/media/press-releases/view/?content=9416&title=Acceptance+Speech+of+SPEAKER+FERDINAND+MARTIN+G.+ROMUALDEZ",
      "content": {
        "datetime": "2025-07-28 02:58 PM",
        "article": "SPEAKER FERDINAND MARTIN G. ROMUALDEZ\nAcceptance Speech\n20th Congress of the Republic of the Philippines\nPlenary Hall | July 28, 2025\n\nHonorable Members of the House of Representatives,\nDistinguished Guests,\nLadies and Gentlemen:\n\nWith humility in my heart and a deep sense of duty, I rise today to accept the renewed trust you have given me to serve once again as Speaker of the House of Representatives.\n\nThis is an honor I embrace with full awareness of the responsibility it entails — not only to this esteemed institution, but most importantly, to the Filipino people we have all sworn to serve.\n\n“Ang tiwala ay hindi gantimpala, kundi panibagong hamon. At bawat hamon ay pagkakataon para maglingkod nang mas tapat, mas totoo, at mas buo.”\n\nAs we open the 20th Congress, we build upon the foundations laid in the 19th — advancing reforms that bring government closer to the people, and restoring trust in this Chamber as the true House of the People.\n\nWe convene at a time that demands unity of purpose, clarity of vision, and courage of conviction. We are not here to preserve power, but to pursue progress. Not to serve ourselves, but to uplift the lives of our fellow citizens.\n\nAnd today, as we formally begin this new chapter, we do so amid a development that once again calls us to reflect on our sacred constitutional duty — the Supreme Court’s decision on the impeachment case filed against the Vice President.\n\nLet me say this with the utmost respect: The Supreme Court has spoken, and we recognize its decision. But let it never be said that the House of the People bowed in silence.\n\nAt the same time, we draw a line: the power to initiate impeachment is the exclusive domain of this Chamber. It flows from the people’s will and rests solely on the clear language of the Constitution. It is neither granted nor guided by any outside institution.\n\nThe Court may close a case, but it cannot close a cause. The pursuit of accountability is not a moment — it is a mandate.\n\nWe are not moved by personalities, but by principles. We are not driven by vendetta, but by vigilance. Our goal has never been to destroy — only to demand the truth.\n\nWhen institutions falter, the House of the People always stands firm. When others fear the storm, your House holds the line.\n\nAnd as your Speaker, I will be here — not just to preside, but to protect. \n\n“Hindi ko kayo iiwan sa gitna ng unos. Gaya ng ama ng tahanan na hindi natutulog kapag may bagyong papasok, babantayan ko ang ating Kapulungan. Sisiguraduhin kong walang bubong ang babagsak, walang pader ang magigiba, at walang miyembro ang mapapabayaan.”\n\n“Kahit anong bagyo at baha, hindi tayo susuko. Titindig tayo at hindi panghihinaan ng loob. Kasama ninyo ako sa pagsalubong ng bagong araw.”\n\nOur work as legislators is both constitutional and moral. It is through the laws we pass — and the accountability we uphold — that we protect rights, promote equity, and shape the future of our democracy.\n\n“Bawat batas na ating ipinapasa ay salamin ng pangarap ng bawat Pilipino — mula sa estudyanteng nangangarap, sa manggagawang lumalaban, hanggang sa pamilyang patuloy na umaasa.”\n\nTo my fellow Representatives — thank you for your continued support and your unwavering commitment to public service. To those who have offered different views, I thank you as well. Your voices enrich our debates and fortify our democracy.\n\n“Hindi kahinaan ang pagkakaiba ng opinyon. Sa Kongresong may respeto, ito’y pinagmumulan ng talino, tapang, at tunay na pagbabago.”\n\nAs your Speaker, I reaffirm our common commitment: to be a House that is transparent in conduct, firm in principle, and responsive to the needs of our people. We shall lead with competence, legislate with compassion, and govern with integrity.\n\nI thank His Excellency, President Ferdinand R. Marcos Jr., for his continued trust in the leadership of this Chamber. The House of Representatives stands ready to be your reliable partner in building a Bagong Pilipinas — a nation that is inclusive, resilient, and grounded in justice and opportunity.\n\nAnd to our beloved Filipino people: you are not just our mandate. You are our mission.\n\nThis House is your voice. And we are ready — ready to speak up, stand up, and act in your name and for your future.\n\n“Ang Kapulungan na ito ay boses ng taumbayan. At kung boses ng taumbayan ang ating dala, tungkulin nating ito’y gamitin — para sa kanilang karapatan, kabuhayan, at kinabukasan.”\n\nLet this be a Congress remembered not only for the laws we passed, but for the lives we changed. Not only for the battles we fought, but for the truth we stood for.\n\nThe judgment that matters most is not that of any single court — but of history, and of the people we serve.\n\nMabuhay ang Kapulungan ng mga Kinatawan.\n\nMabuhay ang sambayanang Pilipino.\n\nMaraming salamat po."
      },
      "PDF": null
    }
  },
  {
    "url": "https://www.congress.gov.ph/media/press-releases/view/?content=9415&title=Romualdez+accepts+Speakership+in+20th+Congress%2C+vows+to+build+on+gains+and+strengthen+a+people-centered%2C+accountable+House",
    "timestamp": 1753854840038,
    "data": {
      "id": "C1",
      "title": "Romualdez accepts Speakership in 20th Congress, vows to build on gains and strengthen a people-centered, accountable House",
      "href": "https://www.congress.gov.ph/media/press-releases/view/?content=9415&title=Romualdez+accepts+Speakership+in+20th+Congress%2C+vows+to+build+on+gains+and+strengthen+a+people-centered%2C+accountable+House",
      "content": {
        "datetime": "2025-07-28 02:10 PM",
        "article": "Office of Rep. Ferdinand Martin G. Romualdez\nReference: Ryan Ponce Pacpaco \n\nREELECTED Leyte Rep. Ferdinand Martin G. Romualdez on Monday formally accepted the speakership of the House of Representatives at the opening of the 20th Congress, reaffirming his commitment to transparent leadership and a legislative agenda grounded in both constitutional duty and moral responsibility.\n\nWith the full backing of the majority coalition and votes totaling 269, Speaker Romualdez said he carries his renewed mandate with humility and a strong sense of responsibility.\n\n\"With humility in my heart and a deep sense of duty, I rise today to accept the renewed trust you have given me to serve once again as Speaker of the House of Representatives,\" Speaker Romualdez said in his address before colleagues and invited guests at the plenary hall.\n\n\"Ang tiwala ay hindi gantimpala, kundi panibagong hamon. At bawat hamon ay pagkakataon para maglingkod nang mas tapat, mas totoo, at mas buo,” he added.\n\nSpeaker Romualdez also addressed the chamber with a message of resolve and constitutional clarity, utilizing the opportunity to highlight accountability in public office and responding to the Supreme Court’s ruling dismissing the impeachment complaint against Vice President Sara Duterte.\n\nPositioning the legislature as a co-equal branch of government with a defined mandate under the Constitution, Speaker Romualdez underscored the House’s exclusive power to initiate impeachment proceedings. \n\n“And today, as we formally begin this new chapter, we do so amid a development that once again calls us to reflect on our sacred constitutional duty — the Supreme Court’s decision on the impeachment case filed against the Vice President,” Speaker Romualdez said.\n\n“Let me say this with the utmost respect: The Supreme Court has spoken, and we recognize its decision. But let it never be said that the House of the People bowed in silence,” Speaker Romualdez said. \n\nHe reiterated the fundamental role of Congress in matters of accountability and reinforced the constitutional boundary between branches of government.\n\n“At the same time, we draw a line: the power to initiate impeachment is the exclusive domain of this Chamber. It flows from the people’s will and rests solely on the clear language of the Constitution. It is neither granted nor guided by any outside institution. The Court may close a case, but it cannot close a cause. The pursuit of accountability is not a moment — it is a mandate,” Speaker Romualdez continued.\n\nSpeaker Romualdez made clear that the House’s actions are driven not by politics, but by principles. \n\nHe affirmed that the chamber’s integrity would not be compromised by external pressures, and that it would continue to safeguard its independence in the face of controversy.\n\n“We are not moved by personalities, but by principles. We are not driven by vendetta, but by vigilance. Our goal has never been to destroy — only to demand the truth. When institutions falter, the House of the People always stands firm. When others fear the storm, your House holds the line. And as your Speaker, I will be here — not just to preside, but to protect,” he stressed.\n\nEnding on a tone of determination and guardianship, Speaker Romualdez emphasized that the chamber would remain steadfast through any institutional storm. \n\nHe likened his role to that of a father watching over his household, pledging to stand firm with his colleagues through whatever lies ahead.\n\n“Hindi ko kayo iiwan sa gitna ng unos. Gaya ng ama ng tahanan na hindi natutulog kapag may bagyong papasok, babantayan ko ang ating Kapulungan. Sisiguraduhin kong walang bubong ang babagsak, walang pader ang magigiba, at walang miyembro ang mapapabayaan,” he stated.\n\n“‘Kahit anong bagyo at baha, hindi tayo susuko. Titindig tayo at hindi panghihinaan ng loob. Kasama ninyo ako sa pagsalubong ng bagong araw,” Speaker Romualdez said. \n\nHe emphasized the importance of accountability in public service, taking note of the constitutional mandate of the House of Representatives to be the true representatives of the people.\n\n\"Our work as legislators is both constitutional and moral. It is through the laws we pass — and the accountability we uphold — that we protect rights, promote equity and shape the future of our democracy,\" Speaker Romualdez stressed. \n\n\"Bawat batas na ating ipinapasa ay salamin ng pangarap ng bawat Pilipino—mula sa estudyanteng nangangarap, sa manggagawang lumalaban, hanggang sa pamilyang patuloy na umaasa.\"\n\nSpeaker Romualdez thanked his colleagues in the chamber for their confidence and unity, acknowledging those who held differing views, noting that respectful disagreement is vital to a functioning democracy.\n\n\"To all my colleagues—thank you for your continued support and your unwavering commitment to public service. To those who have offered different views, I thank you as well. Your voices enrich our debates and strengthen our democracy. It is in this respectful exchange of ideas that we discover enduring, just, and effective solutions,” the Speaker stated.\n\n\"Hindi kailanman kahinaan ang pagkakaiba ng opinyon. Sa Kongresong may respeto, ito’y pinagmumulan ng talino, tapang, at tunay na pagbabago,” he added.\n\nSpeaker Romualdez also pledged that the House under his leadership will act with competence and integrity.\n\n\"As your Speaker, I reaffirm our shared commitment: to be a House that is transparent in conduct, firm in principle, and always responsive to the needs of our people. We shall lead with competence, legislate with compassion, and govern with integrity,” he underscored.\n\nSpeaker Romualdez also thanked President Ferdinand “Bongbong” R. Marcos Jr. for continuing to trust the chamber’s leadership.\n\n\"I thank His Excellency, President Ferdinand R. Marcos Jr., for his continued trust and confidence in the leadership of this Chamber. The House of Representatives stands ready to be your reliable partner in building a Bagong Pilipinas—a nation that is inclusive, resilient, and grounded in justice and opportunity,” he noted.\n\nThe Leyte legislator then directed his message to the Filipino people.\n\n\"And to our beloved Filipino people: you are not just our mandate. You are our mission. You are the reason we are here,” he said.\n\n\"This House is your voice. And we are ready—ready to speak up, ready to stand up, and ready to act in your name and for your future,” he continued.\n\n\"Ang Kapulungan na ito ay boses ng taumbayan. At kung boses ng taumbayan ang ating dala, tungkulin nating ito’y gamitin—para sa kanilang karapatan, kabuhayan, at kinabukasan.\"\n\nSpeaker Romualdez called for unity among lawmakers, stressing that collective action must define the 20th Congress.\n\n“Let this be a Congress remembered not only for the laws we passed, but for the lives we changed. Not only for the battles we fought, but for the truth we stood for,” he said.\n\nThe Speaker added that the “judgment that matters most is not that of any single court — but of history, and of the people we serve.” \n\nSpeaker Romualdez first joined Congress in 2007 and served for three consecutive terms until 2016. After a brief break, he returned in 2019 and quickly rose through the ranks, serving as House Majority Leader during the 18th Congress before assuming the speakership in 2022.\n\nHe is the principal author or sponsor of several landmark measures, including the Bayanihan laws during the pandemic, the New Agrarian Emancipation Act, the Maharlika Investment Fund Act, and the law Creating Specialty Centers in Hospitals Under the Control of the Department of Health, among many others.\n\nHe also leads the Lakas-Christian Muslim Democrats party and the Philippine Constitution Association (PhilConsa) as their president, as well as several major legal, civic and academic organizations. He earned his law degree from the University of the Philippines."
      },
      "PDF": null
    }
  },
  {
    "url": "https://www.congress.gov.ph/media/press-releases/view/?content=9414&title=Romualdez+reelected+unopposed+as+Speaker+for+second+straight+term",
    "timestamp": 1753854846971,
    "data": {
      "id": "C1",
      "title": "Romualdez reelected unopposed as Speaker for second straight term",
      "href": "https://www.congress.gov.ph/media/press-releases/view/?content=9414&title=Romualdez+reelected+unopposed+as+Speaker+for+second+straight+term",
      "content": {
        "datetime": "2025-07-28 12:52 PM",
        "article": "Office of Rep. Ferdinand Martin G. Romualdez\nReference: Ryan Ponce Pacpaco \n\nLEYTE 1st District Rep. Ferdinand Martin G. Romualdez was reelected unopposed as Speaker of the House of Representatives on Monday, securing a second consecutive term with overwhelming support from the chamber’s supermajority coalition at the opening of the 20th Congress.\n\nThis marks the second straight time that Speaker Romualdez clinched the top post without a challenger— a clear show of unity and confidence in his leadership.\n\nSpeaker Romualdez, who also served as Speaker in the 19th Congress, reclaimed the top House post with a landslide vote of confidence from lawmakers, reaffirming his leadership as the chamber’s presiding officer and legislative strategist under the administration of President Ferdinand R. Marcos Jr.\n\nSpeaker Romualdez received a total of 269 votes for the speakership.\n\nIn the presence of his family led by his wife, Tingog Party-list Yedda K. Romualdez, Speaker Romualdez took his oath of office before Bulacan Rep. Salvador Aquino Pleyto Sr.\n\nHouse Secretary General Reginald “Reggie” S. Velasco, the presiding officer of the session, named Iloilo Rep. Lorenz R. Defensor as acting floor leader to ensure an orderly proceedings. \n\nHis unopposed nomination was formally delivered by Quezon 2nd District Rep. David “Jay-jay” Suarez, a stalwart of the ruling Lakas-Christian Muslim Democrats (Lakas-CMD).\n\nSuarez hailed Speaker Romualdez’s transformative leadership in the previous Congress, crediting him for turning the House into “a true House of the People — responsive to the needs of the nation, attuned to the voice of the common Filipino, and anchored in the values of unity, service and progress.”\n\n“Ferdinand Martin G. Romualdez is not only a public servant of experience and stature — he is a leader of empathy, integrity and conviction. A unifier. A reformer. A partner of the President and a champion of the people,” Suarez said.\n\n“Let us entrust the Speakership to a man who has already shown us what dignified, decisive and compassionate leadership looks like. Let us reaffirm our commitment to good governance by placing the gavel once more in capable, steady hands,” he added.\n\nSpeaker Romualdez’s nomination was swiftly seconded by key leaders representing the country’s largest political parties, signaling broad consensus across party lines.\n\nPresidential son and Ilocos Norte 1st District Rep. Ferdinand Alexander A. Marcos seconded the nomination on behalf of the Partido Federal ng Pilipinas (PFP), the President’s party.\n\nQuezon 1st District Rep. Mark Enverga seconded the nomination on behalf of the Nationalist People’s Coalition (NPC), Antipolo 1st District Rep. Ronaldo V. Puno for the National Unity Party (NUP), and Misamis Oriental 2nd District Rep. Yevgeny Vincente Emano for the Nacionalista Party (NP).\n\nTrade Union Congress of the Philippines (TUCP) Party-list Rep. Raymond Democrito Mendoza of the Party-list Coalition Foundation Inc. likewise expressed full support for Speaker Romualdez’s continued speakership, cementing backing from party-list representatives who comprise a significant voting bloc in the chamber.\n\nSpeaker Romualdez’s reelection marks the continuity of leadership that oversaw one of the most productive legislative terms in recent memory.\n\nDuring the 19th Congress, the House passed a series of priority measures aligned with the Bagong Pilipinas agenda, including 61 out of 64 priority measures outlined by the Legislative-Executive Development Advisory Council (LEDAC); strengthened executive-legislative coordination, and earned public trust through transparency, responsiveness and inclusive governance.\n\nThe trust rating of Speaker Romualdez rose from 26% to 34% based on the latest Social Weather Stations (SWS) survey. Public trust in the House of Representatives also climbed from 34% in April to 49% in May, and reached 57% in June.\n\nAccording to Suarez, Speaker Romualdez “brought not just experience, but character — marked by quiet strength, strategic foresight, and unwavering commitment to public service.”\n\n“With clarity of vision and steadiness of hand, he championed landmark reforms, strengthened legislative–executive cooperation, and ensured that every voice, regardless of affiliation or region, found space in our national conversation,” Suarez said.\n\nSuarez emphasized that Romualdez’s leadership style sets him apart from traditional politics.\n\n“Colleagues, I have seen firsthand how Speaker Romualdez works — not for the spotlight, but for results. His leadership transcends titles; it is grounded in listening, guided by principle, and driven by an enduring faith in the Filipino people,” he said.\n\nHe added: “In the face of adversity, he remains calm. Under pressure, he stays grounded. Amid political divisions, he builds bridges. And in times of doubt, he leads with heart.”\n\nSuarez also cited Speaker Romualdez’s track record during the previous Congress, describing it as “one of the most productive and purposeful legislative terms in recent memory.”\n\n“We passed priority measures that advanced the goals of Bagong Pilipinas, empowered communities, and created pathways for inclusive and sustainable growth,” Suarez said. “But more than numbers or laws, he gave us direction — and he gave the public something more important than power: trust.”\n\nThat trust, Suarez stressed, was “earned through hard work, transparency, and a kind of leadership that listens more than it speaks, delivers more than it promises, and unites more than it divides.”"
      },
      "PDF": null
    }
  },
  {
    "url": "https://www.congress.gov.ph/media/press-releases/view/?content=9413&title=SETTING+THE+RECORD+STRAIGHT%3A+SUPREME+COURT+DECISION+BASED+ON+ERRONEOUS+FACTS",
    "timestamp": 1753854853863,
    "data": {
      "id": "C1",
      "title": "SETTING THE RECORD STRAIGHT: SUPREME COURT DECISION BASED ON ERRONEOUS FACTS",
      "href": "https://www.congress.gov.ph/media/press-releases/view/?content=9413&title=SETTING+THE+RECORD+STRAIGHT%3A+SUPREME+COURT+DECISION+BASED+ON+ERRONEOUS+FACTS",
      "content": {
        "datetime": "2025-07-27 10:48 AM",
        "article": "ATTY. PRINCESS ABANTE\nSPOKESPERSON, HOUSE OF REPRESENTATIVES\n\nUna sa lahat, nananatili ang respeto ng Kamara sa ating Korte Suprema. Subalit kami ay lubos na nababahala matapos naming matanggap at mabasa ang Desisyon ng Korte Suprema kung saan pinawalang-bisa ang impeachment complaint na isinampa noong Pebrero 5, 2025 laban kay Vice President Sara Duterte.\n\nAng Kamara, matapos ang masusing pag-aaral, ay maghahain ng Motion for Reconsideration dahil ang Desisyon—na nagsasabing ang Articles of Impeachment na ipinadala sa Senado ay barred o unconstitutional—ay nakaangkla sa mga factual premises o findings na mali at salungat sa opisyal na rekord ng Kamara.\n\nNaninindigan ang Kamara na ang proseso ng impeachment ay naaayon at sumunod sa Konstitusyon at jurisprudence gaya ng desisyon sa Francisco at Gutierrez. Sa madaling salita, ginawa ng Kamara ang lahat upang sundan ang mga alituntunin at prinsipyo ng ating Saligang Batas at ng mga naunang pasya ng Korte Suprema. Kaya’t kami’y lubos na nababahala sa tila bagong mga rekisito na ipinataw sa nasabing Desisyon.\n\nOne of the central facts in the Supreme Court decision is the claim that the February 5 impeachment complaint was transmitted to the Senate without a plenary vote. This is categorically false. Mali po ito. Noong Pebrero 5, 2025, si Majority Leader Mannix Dalipe ang nagmungkahi na ipasa ang Pebrero complaint sa Senado, batay sa katotohanang ito ay verified at pirmado ng hindi bababa sa 1/3 ng mga miyembro ng Kamara. Ang mosyong ito ay inaprubahan sa plenaryo, at agad ring bumuo ang Kamara ng panel of public prosecutors. Makikita ito sa House Journal No. 36 at detalyado rin sa opisyal na Record of the House of Representatives. Ang transmittal sa Senado ay hindi unilateral o ministerial—it was a clear result of plenary action.\n\nThe Court also claimed that the House failed to act on the first three impeachment complaints filed in December 2024. This, too, is inaccurate. Sa parehong araw na inaksyunan ang February complaint, bumoto rin ang Kamara sa plenaryo na i-archive ang tatlong impeachment complaints na inihain noong Disyembre. Ginawa ito ilang oras bago mag-adjourn ang session, dahil nakumpirma na ang Pebrero complaint ay pirmado at verified ng 1/3 ng mga miyembro ng Kamara. Ayon sa Konstitusyon, ito ay itinuturing nang Articles of Impeachment at obligadong ipadala sa Senado para sa paglilitis.\n\nGayunman, sinabi ng Korte na hindi raw kumilos ang Kamara sa tatlong reklamo dahil nag-adjourn na ito—na para bang pinabayaan ang mga ito nang walang aksyon o konsiderasyon. Ito ay malinaw na salungat sa opisyal na rekord at sa mga dokumentong isinumite mismo sa Korte Suprema.\n\nThe conclusion drawn by the Supreme Court—that the February complaint violated the one-year bar—is therefore grounded on a factual and procedural inversion. Ang pinakabatayang saligan ng Desisyon kung saan umikot ang mga legal pronouncements ng Korte ay mali. Hindi isinama ang plenary vote, mali ang pagbasa sa timeline ng mga kilos ng Kamara, at mas pinaniwalaan ang isang news article kaysa sa House Journal at opisyal na report na isinumite mismo sa Korte. Nakababahala na ang Desisyon ay hindi man lang bumanggit o tumugon sa mga dokumentong ito.\n\nThe Supreme Court also invalidated the Articles of Impeachment on the ground of due process. Ayon sa Korte, kahit ang reklamong pirmado na at verified ng 1/3 ng mga miyembro ay kailangan pa ring basahin ng bawat pumirma at pagkatapos ay i-refer muli sa plenaryo upang pagbotohan. Dapat din daw ay nabigyan ng kopya at pagkakataon ang respondent na sagutin ang reklamo bago ito maisumite sa Senado. Ngunit wala pong ganitong rekisito sa ating Konstitusyon o sa mga Rules ng Kamara. Sa madaling salita, nagbigay ang Korte ng panibagong patakaran na wala naman sa umiiral na batas. Pinawalang-bisa nila ang Articles of Impeachment base sa mga bagong pamantayan ng due process para sa respondent.\n\nMayroon tayong tinatawag na doctrine of operative facts—ibig sabihin, kung sinunod ang batas na umiiral sa panahon ng pagkilos, maituturing na legal at valid ang pagkilos. Ang Kamara ay pinarusahan dahil sinunod namin ang Francisco at Gutierrez rulings—mga pasyang galing din sa Korte Suprema.\n\nIt should also be said—kung due process at opportunity to be heard ang usapan, ilang beses nang naimbitahan si VP Sara Duterte sa mga pagdinig ng Committee upang siya ay mabigyan ng pagkakataong ipaliwanag ang kanyang panig. Ngunit nanatili siyang tikom ang bibig.\n\nThe House has also reviewed the now very stringent requirements imposed by the Court before an impeachment complaint can move forward. These are requirements that essentially amend the Constitution and represent an unacceptable intrusion into the exclusive powers of the House of Representatives.\n\nIt is for these reasons that the House will be filing a Motion for Reconsideration. We remain hopeful that once the facts are corrected, the Court will arrive at a different and more just conclusion.\n\nMuli, ang impeachment complaint laban kay VP Sara Duterte ay dumaan sa wastong proseso. Inaprubahan ito ng Kamara sa plenaryo. Ipinadala ito sa Senado na may buong awtoridad ng institusyong may pananagutan sa Saligang Batas.\n\nTo disregard these facts is not only a disservice to the truth—it is a disservice to the Constitution itself.\n\nNananatiling matatag ang Kamara sa tungkuling ipagtanggol ang integridad ng ating mga demokratikong institusyon. Hinihikayat namin ang publiko na basahin ang mga rekord, sundan ang mga pangyayari, at huwag malito sa maling impormasyon. Malinaw ang katotohanan. Nagkaroon ng botohan. Naitala ito sa opisyal na talaan. At ginawa ng Kamara ang kanyang tungkulin."
      },
      "PDF": null
    }
  },
  {
    "url": "https://www.congress.gov.ph/media/press-releases/view/?content=9412&title=Romualdez+expects+PBBM%E2%80%99s+4th+SONA+to+build+on+gains%2C+set+inclusive+path+forward",
    "timestamp": 1753854863576,
    "data": {
      "id": "C1",
      "title": "Romualdez expects PBBM’s 4th SONA to build on gains, set inclusive path forward",
      "href": "https://www.congress.gov.ph/media/press-releases/view/?content=9412&title=Romualdez+expects+PBBM%E2%80%99s+4th+SONA+to+build+on+gains%2C+set+inclusive+path+forward",
      "content": {
        "datetime": "2025-07-27 08:32 AM",
        "article": "Office of Rep. Ferdinand Martin G. Romualdez\nReference: Ryan Ponce Pacpaco \n\nREELECTED Leyte 1st District Rep. Ferdinand Martin G. Romualdez on Sunday expressed confidence that President Ferdinand “Bongbong” R. Marcos Jr.’s fourth State of the Nation Address (SONA) will reinforce the government’s commitment to inclusive growth and responsive governance.\n\n“As President Ferdinand R. Marcos Jr. prepares to deliver his fourth State of the Nation Address, I am proud of the gains he has made under his steady and compassionate leadership,” said Rep. Romualdez, Speaker of the 19th Congress.\n\n“From bold economic recovery initiatives to decisive investments in agriculture, infrastructure, education, and digital innovation, the President has shown that strong governance can uplift lives and restore confidence in our nation’s future,” Rep. Romualdez, a lawyer from the University of the Philippines and Philippine Constitution Association president, added.\n\nRep. Romualdez, also Lakas-Christian Muslim Democrats (CMD) president, said the upcoming SONA provides an opportunity to further strengthen the country’s progress while addressing urgent public concerns.\n\n“But the work is far from over. The Filipino people continue to face challenges—from rising costs of basic goods to the need for better healthcare, stable jobs, and improved access to education and social services,” Rep. Romualdez said.\n\nAccording to Romualdez, this year’s SONA “is a chance to build on what we’ve achieved and set a clear, compassionate and forward-looking agenda that speaks to the real needs of our people.”\n\nHe added that the House of Representatives remains fully committed to supporting the President’s priorities through legislation that delivers meaningful results.\n\n“We in the House of Representatives stand firmly behind the President’s vision. We are ready to translate his priorities into action by passing laws that will ease the burden on Filipino families, strengthen our economy, and ensure that no one is left behind in the journey toward a truly inclusive and secure future,” Rep. Romualdez said."
      },
      "PDF": null
    }
  },
  {
    "url": "https://www.congress.gov.ph/media/press-releases/view/?content=9411&title=Romualdez+welcomes+PBMM%E2%80%99s+launch+of+PhilHealth%E2%80%99s+expanded+primary+health+care+program",
    "timestamp": 1753854870466,
    "data": {
      "id": "C1",
      "title": "Romualdez welcomes PBMM’s launch of PhilHealth’s expanded primary health care program",
      "href": "https://www.congress.gov.ph/media/press-releases/view/?content=9411&title=Romualdez+welcomes+PBMM%E2%80%99s+launch+of+PhilHealth%E2%80%99s+expanded+primary+health+care+program",
      "content": {
        "datetime": "2025-07-27 07:40 AM",
        "article": "Office of Leyte Rep. Ferdinand Martin G. Romualdez\nReference: Ryan Ponce Pacpaco\n\nReelected Leyte 1st District Rep. Ferdinand Martin G. Romualdez today welcomed the Philippine Health Insurance Corporation’s expanded primary healthcare program aimed at improving access and lowering Filipinos’ out-of-pocket healthcare expenses.\n\nOn Friday President Ferdinand R. Marcos Jr.  launched PhilHealth’s Yaman ng Kalusugan Program para Malayo sa Sakit (YAKAP) that enhanced the existing program to bring health care services closer to communities and reduce the need for hospital confinement.\n\nRep. Romualdez commended President Marcos for launching the program, calling it a demonstration of the administration’s commitment to deliver responsive and inclusive health care for all Filipinos.\n\n“Ang kalusugan ng ating mga kababayan ay isang yaman na dapat inaalagaan ng pamahalaan. Ngunit alam natin ang kanilang mga hinaing - malayo ang ospital, mahaba ang mga pila, at mahal ang magpagamot,” said Rep. Romualdez.\n\n“Walang mayaman o mahirap kapag ikaw ay nagkasakit. Kaya isang magandang hakbang ng ang paglulunsad ni Pangulong Marcos ng mas pinalawig na serbisyong pangkalusugan upang matulungan ang mga kapos-palad na mabigyang lunas ang kanilang mga karamdaman,” he added.\n\nThe Leyte lawmaker is optimistic about PhilHealth’s YAKAP program, which improved access to primary health care services — including treatment, diagnostic exams and medicines — as well as its focus shift from treatment to prevention, would make a significant impact on the health and well-being of Filipino families. \n\nUnder the YAKAP program — formerly the Konsulta package — Filipinos may now avail of 13 diagnostic tests and six cancer screening tests that include mammography, liver ultrasound, low-dose CT scan and colonoscopy. \n\nThey can also avail of 75 medicines covered by the state health insurer, an improvement from the 54 medicines previously offered under the old package.\n\nRep. Romualdez also lauded PhilHealth for the YAKAP program as manifestation of the state health insurer’s dedication to introducing innovations, particularly its emphasis on preventive health care as a long-term solution to the country’s health challenges. \n\n“Ang PhilHealth ay hindi lamang dapat ginagamit kapag ang pasyente ay kailangan nang maospital. Nararapat lamang na ang PhilHealth ay nagagamit din ng pasyente para sa preventive health care para maagapan ang mga sakit bago pa ito lumala,” he said.\n\nHe likewise hailed the state health insurer and the Marcos administration for simplifying the registration process for the YAKAP program through various digital platforms such as the eGovPH mobile application, the PhilHealth Member Portal (www.philhealth.gov. ph), or through PhilHealth offices and PhilHealth-accredited primary care providers across the country.\n\n“For many Filipinos, affordable and accessible health care service is now as easy as a simple tap on their smartphones. This is what Bagong Pilipinas is all about — an encompassing mission to improve Filipinos’ welfare through better services and technology,” Rep. Romualdez added."
      },
      "PDF": null
    }
  },
  {
    "url": "https://www.congress.gov.ph/media/press-releases/view/?content=9410&title=Romualdez+lauds+Marcos+for+securing+over+%2421B+in+investments%2C+says+it+signals+brighter+future+for+Filipinos",
    "timestamp": 1753854877423,
    "data": {
      "id": "C1",
      "title": "Romualdez lauds Marcos for securing over $21B in investments, says it signals brighter future for Filipinos",
      "href": "https://www.congress.gov.ph/media/press-releases/view/?content=9410&title=Romualdez+lauds+Marcos+for+securing+over+%2421B+in+investments%2C+says+it+signals+brighter+future+for+Filipinos",
      "content": {
        "datetime": "2025-07-26 07:46 AM",
        "article": "Office of Leyte Rep. Martin G. Romualdez\nReference: Ryan Ponce Pacpaco\n\nReelected Leyte 1st District Rep. Ferdinand Martin G. Romualdez on Thursday hailed President Ferdinand R. Marcos Jr. for securing over $21 billion in investment pledges and $63 million in development assistance during his recent official visit to the United States—emphasizing its huge potential to drive economic growth and generate quality jobs for Filipinos.\n\nIn his arrival statement following a three-day official trip to Washington, D.C., President Marcos reported that his engagements resulted in over $21 billion in investment pledges from leading multinational companies.\n\nHe further announced that the U.S. government committed $15 million in support of private sector development under the Luzon Economic Corridor Initiative, and an additional $48 million in foreign-assisted development projects.\n\n“These commitments are clear proof that President Marcos is doing what it takes to attract long-term capital that will translate into real benefits for our people—more jobs, more infrastructure, and more opportunities for every Filipino family,” Rep. Romualdez said.\n\nHe also highlighted the importance of the President’s diplomatic efforts to bolster the Philippines’ longstanding alliance with the United States—not only to uphold regional peace and stability, but also to expand trade, investment and economic cooperation that supports the country’s long-term development.\n\nPresident Marcos said his U.S. visit “reaffirmed our mutual commitment to further strengthening our longstanding alliance and growing our economies for the benefit of our people and in pursuit of our national interest.”\n\n“The President has made it clear that the Philippines is open for business—and the world is responding positively. These investment commitments are the result of consistent leadership, credibility, and the country’s improving economic fundamentals,” Rep. Romualdez said.\n\n“We are witnessing the early gains of Bagong Pilipinas—a nation that is globally connected, economically confident, and better equipped to rise above challenges,” he added.\n\nRep. Romualdez emphasized that the 20th Congress must play a crucial role in ensuring that these pledges are translated into actual investments through legislation that positions the Philippines as the preferred investment destination in Asia.\n\nToward this end, he committed to advancing legislative measures aligned with the President’s economic agenda to build a more dynamic, resilient, and inclusive economy.\n\n“Ang ating tungkulin sa Kongreso ay tiyaking maisasakatuparan ang mga planong ito sa pamamagitan ng batas. Kung may kumpiyansa ang mundo sa atin, mas lalo tayong dapat magkaisa upang itaguyod ang kinabukasan ng bawat Pilipino,” Rep. Romualdez said."
      },
      "PDF": null
    }
  },
  {
    "url": "https://www.congress.gov.ph/media/press-releases/view/?content=9409&title=Romualdez+thanks+South+Korea+for+2%2C000+MT+rice+donation%2C+says+it+affirms+strong+bilateral+ties",
    "timestamp": 1753854884308,
    "data": {
      "id": "C1",
      "title": "Romualdez thanks South Korea for 2,000 MT rice donation, says it affirms strong bilateral ties",
      "href": "https://www.congress.gov.ph/media/press-releases/view/?content=9409&title=Romualdez+thanks+South+Korea+for+2%2C000+MT+rice+donation%2C+says+it+affirms+strong+bilateral+ties",
      "content": {
        "datetime": "2025-07-25 06:53 AM",
        "article": "Office of Leyte Rep. Ferdinand Martin G. Romualdez\nReference: Ryan Ponce Pacpaco\n\n\nREELECTED Leyte 1st District Rep. Ferdinand Martin G. Romualdez on Tuesday thanked South Korea for its generous rice donation to the Philippines to support food security and disaster response measures. \n\nIn an announcement on Tuesday, the Korean Embassy said it will donate 2,016 metric tons of rice to the Philippines, “to support swift responses to humanitarian crises and persistent rice shortages in vulnerable communities.”\n\nHailing it as a testament to the robust alliance between the two countries, Rep. Romualdez expressed his deep appreciation for Seoul’s timely support, especially as many parts of the country reel from a recent typhoon and flooding triggered by heavy monsoon rains.\n\n“South Korea’s heartwarming donation is proof of its strong ties with the Philippines and its selflessness to look out for its neighbors in Asia - a reflection of Asian values of unity and community,” he said.\n\n“The Philippines and its people are truly grateful for the helping hand that Seoul extended to us in our time of need. It would boost our government’s efforts to extend assistance to many of our kababayans affected by the floods,” Rep. Romualdez added. \n\nHe assured the Korean government that the Philippine government under the leadership of President Ferdinand R. Marcos Jr., would utilize the donated rice judiciously and in line with its intended purpose. \n\n“This donated rice will be used as intended: in delivering aid to disaster victims and providing access to affordable food in our most vulnerable communities. This is how the Philippines repays the kindness of its allies and neighbors: by bringing the aid it receives to people and places that need it the most,” he said.\n\nThe turnover ceremony for the donated rice is scheduled for August in Manila. Of the 2,016 metric tons of rice, 1,616 will go to the Department of Social Welfare and Development, while 400 metric tons will go to the Bangsamoro Autonomous Region in Muslim Mindanao. \n\nRep. Romualdez noted that aside from providing assistance to disaster victims, the rice donation may also be utilized in the Marcos administration's program that provides marginalized sectors access to P20 per kilo rice.\n\n“This generous donation could also complement the Marcos administration’s ‘Benteng Bigas, Meron Na!’ initiative and will certainly help the Philippines inch closer to its goal of attaining food security.”\n\nRep. Romualdez reminded concerned government agencies to ensure the timely delivery of the donated rice to the intended beneficiaries. \n\n“Ang bigas na ito ay ibibigay sa atin para mapadali at mapabilis ang relief operations ng pamahalaan para sa mga nasalanta. Hindi dapat pinaghihintay ang mga benepisyaryo at dapat matanggap nila ito sa maayos at organisadong proseso, tulad nang ninanais ng South Korea,” he said.\n\nIt may be recalled that in February this year, South Korea also gave 4,000 metric tons or 100,000 bags of rice to the Philippines to aid the government’s relief operations in the wake of Severe Tropical Storm Kristine. \n\nThe donation is part of the ASEAN Plus Three Emergency Rice Reserve’s Tier 3 program, where South Korea actively participates as a donor."
      },
      "PDF": null
    }
  },
  {
    "url": "https://www.congress.gov.ph/media/press-releases/view/?content=9408&title=Romualdez+calls+for+toned-down+SONA+ceremonies+in+light+of+recent+calamities",
    "timestamp": 1753854892191,
    "data": {
      "id": "C1",
      "title": "Romualdez calls for toned-down SONA ceremonies in light of recent calamities",
      "href": "https://www.congress.gov.ph/media/press-releases/view/?content=9408&title=Romualdez+calls+for+toned-down+SONA+ceremonies+in+light+of+recent+calamities",
      "content": {
        "datetime": "2025-07-24 02:22 PM",
        "article": "Office of Rep. Ferdinand Martin G. Romualdez\nReference: Ryan Ponce Pacpaco \n\nREELECTED Leyte Rep. Ferdinand Martin G. Romualdez on Thursday called for the simplification of red carpet and ceremonial arrangements for the opening of the 20th Congress and the President’s State of the Nation Address (SONA), citing the need for sobriety and sensitivity in the wake of recent natural disasters.\n\n“In the past weeks, tropical cyclones Crising, Dante and Emong have displaced families, destroyed livelihoods, and left many of our kababayan struggling to get back on their feet,” said Rep. Romualdez, who served as Speaker in the 19th Congress. \n\n“It would be out of touch to maintain a show of pageantry while our people are still in recovery,” added Rep. Romualdez, a lawyer from the University of the Philippines and president of Philippine Constitution Association.\n\nRep. Romualdez said he has requested the Office of the Secretary General, if possible, to retain formal protocols but forego red carpet fanfare, fashion coverage and ceremonial staging.\n\n“We will still observe decorum and tradition, but without the spectacle. The red carpet will be used for its functional purpose, not as a platform for display,” he said.\n\nHe clarified that members of Congress remain free to speak with media on their way in, as is customary.\n\n“This is not about restricting access or silencing anyone. It’s about setting the tone: focused, grounded and responsive,” Rep. Romualdez stressed.\n\n“The opening of Congress is not a fashion event, it is a working session. Let’s begin it with the seriousness and humility our times demand,” he said. \n\nThe 20th Congress will formally open on July 28, followed by the President’s address to the nation."
      },
      "PDF": null
    }
  },
  {
    "url": "https://www.congress.gov.ph/media/press-releases/view/?content=9407&title=Romualdez+vows+to+spearhead+initiatives+in+Congress+to+advance+gains+reflected+in+latest+PH+development+indicators",
    "timestamp": 1753854899328,
    "data": {
      "id": "C1",
      "title": "Romualdez vows to spearhead initiatives in Congress to advance gains reflected in latest PH development indicators",
      "href": "https://www.congress.gov.ph/media/press-releases/view/?content=9407&title=Romualdez+vows+to+spearhead+initiatives+in+Congress+to+advance+gains+reflected+in+latest+PH+development+indicators",
      "content": {
        "datetime": "2025-07-24 08:19 AM",
        "article": "Office of Leyte Rep. Ferdinand Martin G. Romualdez\nReference: Ryan Ponce Pacpaco\n\nREELECTED Leyte 1st District Rep. Ferdinand Martin G. Romualdez today welcomed the gains reflected in the 2024 Statistical Indicators on Philippine Development, saying these are concrete manifestations that the Philippine Development Plan (PDP) 2023–2028 of President Ferdinand R. Marcos Jr. is on the right track.\n\nReleased by the Philippine Statistics Authority (PSA) on July 21, the report showed, among others, that food inflation dropped to 4.5 percent in 2024 from 8.0 percent in 2023—a significant decline of 3.5 percentage points—indicating easing prices across key food commodities.\n\nTo preserve and build upon these gains, Rep. Romualdez vowed to push for additional reforms in the 20th Congress focused on controlling inflation, reducing poverty and accelerating inclusive economic growth, in full support of the Marcos administration's economic vision.\n\n“These numbers clearly manifest the firm commitment of President Marcos to uplift the lives of our people. While we are pleased with these positive developments, a lot of work remains to be done to accelerate the pace toward achieving our President’s vision for a Bagong Pilipinas—where no one is left behind,” Rep. Romualdez said.\n\nHe noted that while progress has been made, many Filipino families—especially in rural and low-income communities—continue to struggle with the high cost of living, particularly food.\n\n“Food prices may have eased, pero para sa maraming Pilipino, pagkain pa rin ang pinakamalaking gastusin. Kaya’t dapat unahin ng 20th Congress ang pagpasa ng mga batas na makakapagpababa pa ng presyo at makakagawa ng pagkain na abot-kaya at sapat para sa lahat,” he said.\n\nRep. Romualdez said he is ready to support legislative proposals that provide stronger backing for local food producers, expand the country’s cold storage and logistics infrastructure, and build the capacity of local government units to better manage food supply chains. \n\nHe also pointed out the importance of modernizing national food agencies and clearly defining their mandates, especially in responding to supply shocks that affect market prices.\n\nRep. Romualdez also welcomed the PSA report showing that the national unemployment rate declined to 3.8 percent in 2024, down from 4.4 percent in 2023. This, he said, demonstrates a strengthening labor market, but underscored the importance of sustaining and deepening these gains.\n\nHe emphasized that beyond increasing employment, Congress must also focus on raising job quality and addressing underemployment. He said this can be done by expanding access to technical-vocational education and digital upskilling programs, while also providing incentives to companies that create stable, long-term jobs in provinces outside Metro Manila.\n\n“Trabaho ang daan sa ginhawa. Kailangan nating lumikha ng trabaho kung saan naroon ang mga tao, hindi ‘yung napipilitan silang lisanin ang kanilang mga tahanan para lang makahanap ng hanapbuhay,” he stressed.\n\nTo ensure that the benefits of national growth reach more communities, he said Congress must prioritize legislation that promotes public-private partnerships, simplifies business processes, and improves access to capital for small and medium-sized enterprises. He added that national development must translate to opportunities at the local level.\n\n“We need to legislate development that spreads, not concentrates,” he said. “The goal is not just national growth but local opportunity.”\n\nRep. Romualdez also emphasized the importance of grounding legislation in data-driven policymaking. He said the PSA’s statistical indicators provide a vital tool in assessing whether government programs are achieving their goals, and that Congress has a duty to align its efforts with measurable targets set in the PDP.\n\n“Our job is to turn plans into laws—and laws into better lives,” Rep. Romualdez said. “Ang PSA ang nagsasabi kung nasaan tayo. Ang Kongreso ang kikilos para makarating tayo kung saan tayo dapat pupunta.”"
      },
      "PDF": null
    }
  },
  {
    "url": "https://www.congress.gov.ph/media/press-releases/view/?content=9406&title=Romualdez%3A+PBBM+US+visit+strengthens+PH+global+standing+through+trade%2C+security%2C+diplomacy",
    "timestamp": 1753854906207,
    "data": {
      "id": "C1",
      "title": "Romualdez: PBBM US visit strengthens PH global standing through trade, security, diplomacy",
      "href": "https://www.congress.gov.ph/media/press-releases/view/?content=9406&title=Romualdez%3A+PBBM+US+visit+strengthens+PH+global+standing+through+trade%2C+security%2C+diplomacy",
      "content": {
        "datetime": "2025-07-23 09:45 AM",
        "article": "Office of Rep. Ferdinand Martin G. Romualdez\nReference: Ryan Ponce Pacpaco \n\nPRESIDENT Ferdinand “Bongbong” R. Marcos Jr.’s official visit to the United States (US) marked a critical moment in Philippine diplomacy, with a new trade and defense arrangement placing the country on stronger footing in global affairs, according to reelected Leyte Rep. Ferdinand Martin G. Romualdez.\n\nRep. Romualdez, the Speaker of the 19th Congress, said the outcome of the visit and the discussions with President Donald Trump laid a foundation for broader access to markets, deeper military partnerships and more opportunities for Filipinos at home and abroad.\n\n“This is more than just an official working visit. This is a statement of confidence: that the Philippines is ready to lead, to compete and to stand tall among nations,” Rep. Romualdez, a lawyer from the University of the Philippines and Philippine Constitution Association (Philconsa) president, said Wednesday. \n\n“President Marcos has once again proven that our foreign policy can be both principled and pragmatic, firm in defending our interests, but also generous in building alliances that uplift our people,” he added.\n\nDuring the visit, President Trump announced in a public message the conclusion of a trade agreement and described the engagement as a “beautiful visit” and praised Marcos as a “highly respected” and “tough negotiator.”\n\nRep. Romualdez, Lakas-Christian Muslim Democrats (CMD) president, said this framework offers expanded market access for Filipino products and services, especially for small and medium-sized enterprises looking to scale beyond local borders.\n\n“Access to the US market is a game-changer,” Rep. Romualdez stressed. \n\n“It means more small and medium Filipino enterprises will be able to compete globally. It means more chances for our farmers, our fisherfolk, and our local producers to earn and grow. We are bringing the world closer to our shores and bringing Filipino excellence to the world,” he continued.\n\n“Nations are not built overnight. What matters is that President Marcos secured a seat at the table, and the terms of engagement can be shaped from here. This is how statesmanship works: steady, strategic and always with the people in mind,” he explained.\n\nRep. Romualdez also noted the strengthened defense ties discussed during the visit, aligning with regional efforts to maintain security in the West Philippine Sea and neighboring waters.\n\n“Hindi lang naman tungkol sa pagtatanggol ng ating teritoryo ang issue sa West Philippine Sea. Higit sa lahat, ito ay ang pakikipaglaban para sa karapatan ng bawat mangingisdang Pilipino sa kabuhayan, sa karapatan ng mga kababayan nating maging ligtas at sa karapatan ng susunod na henerasyon na mapasa-kanila ang tunay na atin,” he stated.\n\n“Through this partnership, we are reinforcing peace, not provoking conflict,” Rep. Romualdez said. \n\nHe called Trump’s remarks a reflection of how the Philippines is reasserting its relevance in global affairs.\n\n“President Marcos is not just earning respect abroad: he is using that respect to uplift every ordinary Filipino back home,” Rep. Romualdez said. “It’s easy to talk big in international forums, but harder to deliver real benefits to the people. This President is doing both.”\n\nRep. Romualdez, who has led legislative efforts to align international partnerships with national development, said diplomacy must be rooted in impact.\n\n“When diplomacy results in lower prices for goods, more jobs for our workers, more protection for our borders and more investments in our communities, that is when it becomes real,” Rep. Romualdez said. \n\n“That is when the global becomes local,” he added.\n\nRep. Romualdez ended by calling on all sectors to unite behind the President’s gains abroad.\n\n“We are not a small country with small dreams. We are a nation of over 110 million strong, proud, resilient and hardworking Filipinos. With visionary leadership and a clear direction, we are building a Bagong Pilipinas, one that is respected abroad and feels progress at home,” Rep. Romualdez said."
      },
      "PDF": null
    }
  },
  {
    "url": "https://www.congress.gov.ph/media/press-releases/view/?content=9405&title=Romualdez%3A+Nearly+4+in+10+students+still+drop+out%2C+time+to+strengthen+free+college+education+law",
    "timestamp": 1753854913168,
    "data": {
      "id": "C1",
      "title": "Romualdez: Nearly 4 in 10 students still drop out, time to strengthen free college education law",
      "href": "https://www.congress.gov.ph/media/press-releases/view/?content=9405&title=Romualdez%3A+Nearly+4+in+10+students+still+drop+out%2C+time+to+strengthen+free+college+education+law",
      "content": {
        "datetime": "2025-07-23 09:40 AM",
        "article": "Office of Rep. Ferdinand Martin G. Romualdez\nReference: Ryan Ponce Pacpaco \n\nREELECTED Leyte 1st District Rep. Ferdinand Martin G. Romualdez on Wednesday sounded the alarm over soaring dropout rates in public colleges and universities, urging urgent action to strengthen the Free Higher Education Law and prevent millions of students from falling through the cracks of the country’s most ambitious education reform.\n\n“Free tuition was a landmark achievement, but the work is far from over. Nearly four out of 10 students in state universities and colleges are still dropping out. In some regions, the situation is even more alarming,” Rep. Romualdez lamented.\n\nCiting data from the Second Congressional Commission on Education (EDCOM 2), Rep. Romualdez said the national dropout rate in school year 2023 to 2024 reached 39 percent. \n\nIn the Bangsamoro Autonomous Region in Muslim Mindanao (BARMM), it was as high as 93.4 percent. \n\nCentral Visayas reported 60.7 percent; Zamboanga Peninsula, 59.5 percent; Cordillera, 54.9 percent; Metro Manila, 52.4 percent; Soccsksargen, 51.2 percent; and Western Visayas, 50.2 percent.\n\n“These are not just statistics. They are shattered dreams and interrupted futures, often because students cannot afford transportation, food, rent, books or internet,” Rep. Romualdez said. \n\n“We need to protect and build on the gains of the Free Higher Education Law by ensuring students have the means to actually finish school,” he added.\n\nRep. Romualdez expressed strong support for House Resolution (HR) No. 61 filed by Bicol Saro Party-list Rep. Terry Ridon, which seeks a full review of the implementation and long-term sustainability of Republic Act (RA) 10931 or the Universal Access to Quality Tertiary Education Act.\n\nThe Speaker of the recently concluded 19th Congress said the review should focus on identifying support mechanisms beyond tuition coverage to help students complete their degrees. \n\nHe urged the government to consider strategic interventions such as monthly stipends, transport subsidies, food allowances and digital access programs.\n\n“This is a gap we must urgently fill. If we truly want free higher education to be a ladder out of poverty, we need to make sure our students can actually stay in school and graduate,” he said.\n\nRep. Romualdez also pointed to a Pulse Asia survey conducted in January 2024 and commissioned by Sen. Sherwin Gatchalian, which showed that 98 percent of Filipinos support free tuition in public colleges. \n\nHe said this overwhelming public support reflects a national mandate to strengthen and expand the law.\n\n“The Free Higher Education Law has changed millions of lives. But transformation is not complete when so many students are forced to drop out. Our mission is not just to provide access, but to ensure completion,” he stressed.\n\nRep. Romualdez reaffirmed the commitment of the House of Representatives to championing education reforms that promote equity, youth development and long-term national growth.\n\n“We owe it to our students to fund this law properly. We owe it to every Filipino family to give their children a real chance at a better future. And we owe it to the nation to make education a powerful equalizer, not an unfinished promise,” Rep. Romualdez said."
      },
      "PDF": null
    }
  },
  {
    "url": "https://www.congress.gov.ph/media/press-releases/view/?content=9404&title=P360-M+AKAP+aid%2C+relief+goods+earmarked+for+flood+victims+in+36+congressional+districts",
    "timestamp": 1753854920535,
    "data": {
      "id": "C1",
      "title": "P360-M AKAP aid, relief goods earmarked for flood victims in 36 congressional districts",
      "href": "https://www.congress.gov.ph/media/press-releases/view/?content=9404&title=P360-M+AKAP+aid%2C+relief+goods+earmarked+for+flood+victims+in+36+congressional+districts",
      "content": {
        "datetime": "2025-07-22 01:45 PM",
        "article": "Office of Rep. Ferdinand Martin G. Romualdez\nReference: Ryan Ponce Pacpaco \n \nIN response to the directive of President Ferdinand “Bongbong” R. Marcos Jr., at least P360 million in Ayuda Para sa Kapos ang Kita Program (AKAP) funds, family food packs, and other relief items have been allocated for immediate distribution to 36 congressional districts severely affected by Severe Tropical Storm Crising and the intensified southwest monsoon.\n\nThe AKAP and relief assistance—facilitated through the office of reelected Leyte Rep. Ferdinand Martin G. Romualdez, Speaker of the 19th Congress, in coordination with Tingog Party-list—will be released by the Department of Social Welfare and Development (DSWD) under Secretary Rex Gatchalian.\n\nEach congressional district will receive ?10 million in direct financial aid intended for residents affected by flooding, displacement and other related emergencies.\n\n“This is just the beginning of our coordinated disaster response. Malayo pa ang mararating ng tulong na ito at hindi pa ito ang huli. Ang importante, agad nating naramdaman ang pagtulong ng administrasyong Marcos,” said Rep. Romualdez, a lawyer from the University of the Philippines.\n\nIn addition to the financial aid, relief packs have been readied for mass distribution, including servings of Tingog hot meals for evacuees currently housed in schools, covered courts and other temporary shelters.\n\n“Nais nating iparating sa bawat apektadong pamilyang Pilipino na sa panahon ng kalamidad ay andito ang gobyerno ni Pangulong Marcos para tumulong. Lahat ito ay paalala na hindi kayo nag-iisa. Kasama ninyo kami sa bawat hakbang ng pagbangon,” Rep. Romualdez added.\n\nThe 36 congressional districts set to benefit from the P360 million AKAP fund and related relief efforts include those represented by:\n\nReps. Bienvenido Abante Jr., Tobias “Toby” Tiangco, Dennis “Alden” Almario, Dean Asistio, Arjo Atayde, Jorge Daniel Bocobo, Antonino Calixto, Joel Chua, Ma. Victoria Co-Pilar, Ricardo Cruz Jr., Ernesto Dionisio Jr., Edgar Erice, Jaime Fresnedi, Gerald Galang, Kenneth Gatchalian, Alexandria Gonzales, Monique Lagdameo, Giselle Maceda, Oscar Malapitan, Eric Olivarez, and Antolin “Lenlen” Oreta III.\n\nAlso among the recipients are the districts of:\n\nReps. Franz Pumaren, Romero “Miro” Quimbo, Roman Romulo, Mark Anthony Santos, Jesus “Bong” Suntay, Marcy Teodoro, Irwin Tieng, Ralph Wendel Tulfo, Rolando Valeriano, Patrick Michael “PM” Vargas, Brian Raymund Yamsuan, Ysabel Maria Zamora, Gil Acosta, Jose Alvarez, and Rosalie Salvame.\n\nRep. Romualdez’s office and Tingog Party-list have also reactivated its Relief Coordination Desk, the same mechanism used to facilitate large-scale aid during the pandemic and previous typhoons. The desk serves as a central link between affected lawmakers, national agencies and local responders.\n\nIn Marikina, many evacuees were served hot meals by Tingog volunteers, with more expected as river levels continue to rise. Similar operations were conducted in Quezon City and Manila.\n\nRep. Romualdez said the proactive move to allocate AKAP funds and relief goods reflects hard-learned lessons from past disasters where delays in response had serious consequences. He stressed the importance of readiness and coordination.\n\n“Natutunan na natin ang hirap kapag huli ang aksyon. Kaya ngayon pa lang, naglatag na tayo ng tulong para hindi na kailangang maghintay pa ang mga kababayan natin,” Rep. Romualdez said.\n\nCrising brought days of torrential rain to Luzon and nearby provinces, overwhelming drainage systems, and displacing thousands of families. The Philippine Atmospheric, Geophysical and Astronomical Services Administration has warned of more rainfall in the coming days."
      },
      "PDF": null
    }
  },
  {
    "url": "https://www.congress.gov.ph/media/press-releases/view/?content=9403&title=Romualdez%3A+%E2%80%98Hindi+tayo+maaaring+manahimik+habang+lumulubog+ang+mga+komunidad%E2%80%99",
    "timestamp": 1753854927416,
    "data": {
      "id": "C1",
      "title": "Romualdez: ‘Hindi tayo maaaring manahimik habang lumulubog ang mga komunidad’",
      "href": "https://www.congress.gov.ph/media/press-releases/view/?content=9403&title=Romualdez%3A+%E2%80%98Hindi+tayo+maaaring+manahimik+habang+lumulubog+ang+mga+komunidad%E2%80%99",
      "content": {
        "datetime": "2025-07-21 03:07 PM",
        "article": "Office of Rep. Ferdinand Martin G. Romualdez\nReference: Ryan Ponce Pacpaco \n\n*_Disaster relief operations activated for districts battered by Crising, habagat_*\n\nACTING on President Ferdinand “Bongbong” R. Marcos Jr.’s directive, Leyte 1st District Rep. Ferdinand Martin G. Romualdez, the Speaker of the 19th Congress, and Tingog Party-list on Monday activated disaster monitoring and relief efforts under his congressional office to assist House members whose districts are now battling the aftermath of Severe Tropical Storm Crising and rains intensified by the southwest monsoon (habagat).\n\nEven before the 20th Congress officially opens next week, Rep. Romualdez said his office and Tingog Party-list leaders are already working with local leaders, national agencies and the private sector to ensure help reaches the ground where it is needed most.\n\n“Hindi tayo maaaring manahimik habang lumulubog ang mga komunidad at nangangamba ang ating mga kababayan. Public service doesn’t stop when Congress is out of session. Ngayon mismo, dapat tayong kumilos,” Rep. Romualdez said.\n\n“I’ve been through this myself—my home province of Leyte has seen the worst of disasters. Kaya ramdam ko ang bigat na dinaranas ng mga pamilya ngayon. Sa oras ng sakuna, hindi dapat nag-iisa ang sinuman,” he said. \n\n“My staff and Tingog Party-list are reaching out to House Members whose districts are overwhelmed,” Rep. Romualdez said.\n\nHis congressional office and Tingog Party-list have reopened its Relief Coordination Desk, which became a lifeline for many lawmakers during the height of previous typhoons and the COVID-19 pandemic. This dedicated team will be a one-stop hub for urgent requests and field coordination.\n\nRep. Romualdez called on Filipinos to extend help in any form they can.\n\n“Kahit hindi ka kongresista, kahit hindi ka opisyal—lahat tayo may papel sa pagtulong, kasama ang pagdarasal para sa kaligtasan ng mga nasalanta,” Rep. Romualdez said."
      },
      "PDF": null
    }
  }
]