[
  {
    "url": "https://www.congress.gov.ph/media/view/?content=5929&title=SPEAKER+ROMUALDEZ+PUSHES+FOR+%E2%80%98COMPASSIONATE%E2%80%99+LAWMAKING%0A",
    "timestamp": 1753854937911,
    "data": {
      "id": "C2",
      "title": "SPEAKER ROMUALDEZ PUSHES FOR ‘COMPASSIONATE’ LAWMAKING",
      "href": "https://www.congress.gov.ph/media/view/?content=5929&title=SPEAKER+ROMUALDEZ+PUSHES+FOR+%E2%80%98COMPASSIONATE%E2%80%99+LAWMAKING%0A",
      "content": {
        "datetime": "2025-07-30 11:23 AM",
        "article": "House Speaker Ferdinand Martin Romualdez on Tuesday urged his fellow lawmakers in the 20th Congress to move beyond technical lawmaking and embrace a deeply human approach to governance.\n\n“Let the 20th Congress be a turning point, not just in laws we pass but in the lives that we change,” Speaker Romualdez said. \n\nAddressing his fellow House members at the plenary hall, he underscored that effective legislation must not only be sound in form but must also reflect genuine care for the people it is meant to serve.\n\n“Hindi sapat ang mga batas na mahusay, kailangan nito ay may puso. Hindi sapat ang batas na maganda sa papel, dapat ito ay may saysay sa buhay,” he stated.\n\nAmong the priority measures Romualdez laid out were the Rice Industry Consumer Empowerment Act (RICE Act); institutionalization of the “Walang Gutom Program” through monthly food credits; support for digital skills training and MSMEs; reforms in public education including the Last Mile Schools Act and amendments to the Expanded Government Assistance to Students and Teachers in Private Education (E-GASTPE).\n\nOthers measures to be given importance are zero billing in government hospitals, investments in disaster resilience and defense, full household electrification by 2028 and a transparent, corruption-resistant budget process that includes public oversight and infrastructure audits. \n\nRomualdez emphasized that the work of the House must be guided by empathy and relevance, especially at a time when many Filipinos continue to struggle with daily challenges. For him, compassion must not just be an ideal but a legislative standard.\n\n“Let us make every debate meaningful, let every law reflect compassion, let every session honor the dreams of our people,” he said.\n\nRomualdez ended his speech reminding his peers of the institution’s fundamental role in national life.\n\n“We are the House of the People. Let us be remembered for being worthy of that name,” he concluded."
      },
      "PDF": null
    }
  },
  {
    "url": "https://www.congress.gov.ph/media/view/?content=5928&title=BOXING+CHAMPION+VISITS+SPEAKER+ROMUALDEZ%0A",
    "timestamp": 1753854944747,
    "data": {
      "id": "C2",
      "title": "BOXING CHAMPION VISITS SPEAKER ROMUALDEZ",
      "href": "https://www.congress.gov.ph/media/view/?content=5928&title=BOXING+CHAMPION+VISITS+SPEAKER+ROMUALDEZ%0A",
      "content": {
        "datetime": "2025-07-29 09:46 PM",
        "article": "Speaker Ferdinand Martin G. Romualdez gives a thumbs-up gesture as he joins boxer Vince Paras for a photo during the latter’s courtesy call at the House of Representatives Tuesday, July 29, 2025. Aside from congratulating Paras, Speaker Romualdez extended financial assistance to the boxer. Paras recently clinched the International Boxing Federation Pan Pacific super-flyweight title via a fourth round knockout during their June 29 bout in General Santos City. Romualdez noted that Paras’ victory—despite his failed bid for the IBF minimumweight crown in 2018—demonstrates that with perseverance and grit, Filipinos can rise above challenges."
      },
      "PDF": null
    }
  },
  {
    "url": "https://www.congress.gov.ph/media/view/?content=5927&title=SPEAKER+VOWS+SUPPORT+FOR+MARCOS+SONA+PRIORITIES+%0A",
    "timestamp": 1753854952204,
    "data": {
      "id": "C2",
      "title": "SPEAKER VOWS SUPPORT FOR MARCOS SONA PRIORITIES",
      "href": "https://www.congress.gov.ph/media/view/?content=5927&title=SPEAKER+VOWS+SUPPORT+FOR+MARCOS+SONA+PRIORITIES+%0A",
      "content": {
        "datetime": "2025-07-29 05:39 PM",
        "article": "Speaker Ferdinand Martin G. Romualdez said the House of Representatives will align its legislative agenda with the priorities laid out by President Ferdinand R. Marcos Jr. in his recent State of the Nation Address (SONA). In his message during the opening session of the House on Tuesday, July 29, 2025, he said the House will prioritize legislations addressing the needs of ordinary people, such as food, employment, education and public health."
      },
      "PDF": null
    }
  },
  {
    "url": "https://www.congress.gov.ph/media/view/?content=5926&title=PBBM+DELIVERS+4TH+SONA%0A",
    "timestamp": 1753854959125,
    "data": {
      "id": "C2",
      "title": "PBBM DELIVERS 4TH SONA",
      "href": "https://www.congress.gov.ph/media/view/?content=5926&title=PBBM+DELIVERS+4TH+SONA%0A",
      "content": {
        "datetime": "2025-07-28 06:57 PM",
        "article": "President Ferdinand \"Bongbong\" Marcos Jr. delivers his fourth State of the Nation Address (SONA) at the plenary hall of the House of Representatives on Monday, July 28, 2025. Also in the photo are Senate President Chiz Escudero and House Speaker Ferdinand Martin G. Romualdez."
      },
      "PDF": null
    }
  },
  {
    "url": "https://www.congress.gov.ph/media/view/?content=5925&title=ROMUALDEZ+REELECTED+SPEAKER+FOR+20TH+CONGRESS%0A",
    "timestamp": 1753854966013,
    "data": {
      "id": "C2",
      "title": "ROMUALDEZ REELECTED SPEAKER FOR 20TH CONGRESS",
      "href": "https://www.congress.gov.ph/media/view/?content=5925&title=ROMUALDEZ+REELECTED+SPEAKER+FOR+20TH+CONGRESS%0A",
      "content": {
        "datetime": "2025-07-28 04:49 PM",
        "article": "Leyte Representative Ferdinand Martin Romualdez was elected Monday as the Speaker of the House of Representatives of the 20th Congress.\n\nRomualdez accepted the position as a new opportunity to serve the Filipino people more faithfully.\n\n“Ang tiwala ay hindi gantimpala kundi panibagong hamon. At bawat hamon ay pagkakataon para maglingkod ng mas tapat, mas totoo, mas buo,\" Speaker Romualdez said. \n\nA total of 269 Representatives out of the 290 representatives present at the opening of Congress voted for Romualdez.\n\nQuezon Rep. David “Jay-jay” Suarez led those who nominated Romualdez for the speakership, hailing the House leader as “a unifier, a reformer, a partner of the President and a champion of the people.” \n\n\"Under his stewardship, the House of Representatives became a true House of the People: responsive to the needs of the nation, attuned to the voice of the common Filipino and anchored in the values of unity, service and progress,\" Suarez said. \n\nHe also stated the Speaker’s leadership in the 19th Congress was marked by quiet strength and steadiness of hand, as he consistently listened more, delivered beyond expectations, and brought unity across divisions.\n\nThe nomination also drew cross-party support with Ilocos Norte Rep. Ferdinand Alexander Marcos seconding the motion on behalf of the Partido Federal ng Pilipinas (PFP). Quezon Rep. Wilfrido Mark Enverga, speaking for the National People’s Coalition (NPC) backed the nomination, while Antipolo City Rep. Ronaldo Puno of the National Unity Party (NUP) also expressed their support.\n\nMisamis Oriental Rep. Yevgeny Vicente Emano, representing the Nacionalista Party, and TUCP Party-list Rep. Raymond Democrito Mendoza also threw their support behind Romualdez’s speakership.\n\nHouse Members of the 20th Congress then took their oaths, officially marking the start of the new legislative term.\n\nThe House of Representatives also retained Secretary General Reginald Velasco and House Sergeant-at-Arms retired Police Maj. Gen. Napoleon Taas.\n\nSuarez was then named the new Senior Deputy Speaker, while  Deputy Speakers include Iloilo Rep. Janette Garin, Lanao del Sur Rep. Yasser Alonto Balindong, La Union Rep. Francisco Paolo Ortega V, Zambales Rep. Jefferson Konghun, Ilocos Sur Rep. Kristine Singson-Meehan, Antipolo CIty Rep. Ronaldo Puno, Isabela Rep. Faustino Michael Carlos Dy III, Iloilo Rep. Ferjenel Biron, and TUCP Party-list Rep. Raymond Mendoza.\n\nIlocos Norte Rep. Ferdinand Alexander Marcos was also elected as the Majority Leader for the 20th Congress."
      },
      "PDF": null
    }
  },
  {
    "url": "https://www.congress.gov.ph/media/view/?content=5924&title=REP.+MARTIN+ROMUALDEZ+ELECTED+SPEAKER+ANEW",
    "timestamp": 1753854972962,
    "data": {
      "id": "C2",
      "title": "REP. MARTIN ROMUALDEZ ELECTED SPEAKER ANEW",
      "href": "https://www.congress.gov.ph/media/view/?content=5924&title=REP.+MARTIN+ROMUALDEZ+ELECTED+SPEAKER+ANEW",
      "content": {
        "datetime": "2025-07-28 02:53 PM",
        "article": "Bulacan Rep. Salvador Pleyto administers the oath of office to newly elected Speaker of the House of Representatives, Leyte 1st District Rep. Ferdinand Martin G. Romualdez, who is joined by his family. Romualdez was elected Speaker during the opening session of the 20th Congress on Monday morning."
      },
      "PDF": null
    }
  },
  {
    "url": "https://www.congress.gov.ph/media/view/?content=5923&title=SOLONS+OFFER+THANKSGIVING+MASS%3B+SET+SIGHTS+ON+KEY+REFORMS%0A",
    "timestamp": 1753854980637,
    "data": {
      "id": "C2",
      "title": "SOLONS OFFER THANKSGIVING MASS; SET SIGHTS ON KEY REFORMS",
      "href": "https://www.congress.gov.ph/media/view/?content=5923&title=SOLONS+OFFER+THANKSGIVING+MASS%3B+SET+SIGHTS+ON+KEY+REFORMS%0A",
      "content": {
        "datetime": "2025-07-27 09:45 PM",
        "article": "Lawmakers attended a Thanksgiving Mass at the Manila Cathedral on Sunday in preparation for the start of the 20th Congress on July 28, 2025.\n\nTINGOG Party-list Rep. Jude Acidre said the Mass was not just ceremonial, but a gesture of faith as Congress faces the start of a new three-year term.\n\n“With all the challenges we're facing, with all the problems that we have to deal with, it would be a good thing for members of Congress to begin everything with a prayer,\" Acidre added.\n\nAccording to Acidre, the prayers offered through the mass go beyond the opening and the orderly conduct of the fourth State of the Nation Address (SONA) of President Ferdinand Marcos Jr., \"(we are) praying for ...  really a productive year ahead of us.” \n\nHe also lauded the move to forego the red carpet ceremonies so that focus could be more on the substantive directions that President Marcos will give in the SONA.\n\n“Mas mabuting talakayin natin kung ano po ang dapat gawin at dapat tuparin ng mga halal na kinatawan ng ating bansa,” Acidre said.\n\nBicol Saro Party-list Rep. Terry Ridon agreed, “It is important po na mag-focus po talaga tayo doon sa mga gut issues at this point.\"\n\nHe cited the impact of the Rice Tarrification Law as one of the basic economic needs that Congress should tackle.\n\n\"Mahalagang mahalaga mapag-usapan ho natin ang presyo ng pagkain, presyo ng bigas, presyo ng mga pangangailangan,” Ridon said.\n\nAcidre identified education reform, MSME (micro, small and medium enterprises) support, a fair wage increase, and improved disaster management as additional House priorities aside from food security."
      },
      "PDF": null
    }
  },
  {
    "url": "https://www.congress.gov.ph/media/view/?content=5922&title=HOUSE+OF+REPRESENTATIVES+HOLDS+THANKSGIVING+MASS+TO+MARK+CONVENING+OF+20TH+CONGRESS",
    "timestamp": 1753854988939,
    "data": {
      "id": "C2",
      "title": "HOUSE OF REPRESENTATIVES HOLDS THANKSGIVING MASS TO MARK CONVENING OF 20TH CONGRESS",
      "href": "https://www.congress.gov.ph/media/view/?content=5922&title=HOUSE+OF+REPRESENTATIVES+HOLDS+THANKSGIVING+MASS+TO+MARK+CONVENING+OF+20TH+CONGRESS",
      "content": {
        "datetime": "2025-07-27 09:44 PM",
        "article": "Archbishop Jose Cardinal Advincula of the Roman Catholic Archdiocese of Manila, together with bishops and priests, joins a group photo with House Members led by Leyte 1st District Rep. Ferdinand Martin G. Romualdez and Ilocos Norte Rep. Sandro Marcos following  the Thanksgiving Mass to mark the convening of the 20th Congress at Minor Basilica and Metropolitan Cathedral of the Immaculate Conception in Intramuros, Manila Sunday, July 27, 2025."
      },
      "PDF": null
    }
  },
  {
    "url": "https://www.congress.gov.ph/media/view/?content=5921&title=ALL+SYSTEMS+GO+FOR+PBBM%E2%80%99s+4th+SONA%0A",
    "timestamp": 1753854995780,
    "data": {
      "id": "C2",
      "title": "ALL SYSTEMS GO FOR PBBM’s 4th SONA",
      "href": "https://www.congress.gov.ph/media/view/?content=5921&title=ALL+SYSTEMS+GO+FOR+PBBM%E2%80%99s+4th+SONA%0A",
      "content": {
        "datetime": "2025-07-21 08:42 PM",
        "article": "With just a week left before President Ferdinand Marcos Jr. delivers his fourth State of the Nation Address (SONA), the House of Representatives convened with key government agencies on Monday for the final interagency coordination meeting to ensure the smooth, orderly and successful conduct of the annual event.\n\nHouse Secretary General Reginald Velasco reported that preparations are already in their final stages. Guest lists have been completed, invitations have been sent out, and all seats inside the plenary hall are now fully accounted for. \n\nThe Department of Foreign Affairs representative reported that members of the diplomatic corps who have confirmed attendance to the event have grown to 85. \n\nTo accommodate more guests for this year’s SONA, Velasco said there will be viewing halls within the Batasan Pambansa Complex. \n\nHouse Engineering and Physical Facilities Department Deputy Secretary General (DSG) Renato Dela Torre detailed the holding room assignments for different key government agency personnel. \n\nHouse Legislative Security Bureau (LSB) Executive Director Belinda Bello assured attendees that all necessary security measures are in place. \n\nVelasco said that the complex shall be on lockdown from July 24 to 27 to give way to final setups and security sweeps.\n\nAccording to House Medical and Dental Service Director Dr. Luis Jose Bautista, a total of 160 medical personnel shall be deployed on SONA day, together with 17 ambulances stationed inside the premises. Some 115 hospital rooms have been reserved in various medical facilities around Metro Manila for any medical emergency that may occur.\n\nThe 2025 SONA Working Group also conducted a walk-through to inspect critical areas and ensure all logistics, security measures and technical setup are fully in place for the President’s upcoming address."
      },
      "PDF": null
    }
  },
  {
    "url": "https://www.congress.gov.ph/media/view/?content=5920&title=HOUSE+UPGRADES+PHYSICAL+FACILITIES+FOR+SONA+2025%2C+20th+CONGRESS%0A",
    "timestamp": 1753855003140,
    "data": {
      "id": "C2",
      "title": "HOUSE UPGRADES PHYSICAL FACILITIES FOR SONA 2025, 20th CONGRESS",
      "href": "https://www.congress.gov.ph/media/view/?content=5920&title=HOUSE+UPGRADES+PHYSICAL+FACILITIES+FOR+SONA+2025%2C+20th+CONGRESS%0A",
      "content": {
        "datetime": "2025-07-17 03:33 PM",
        "article": "Improvements of physical facilities at the House of Representatives (HRep) are ongoing in time for the 20th Congress and the fourth State of the Nation Address (SONA) of President Ferdinand R. Marcos Jr.\n\nThe HRep Engineering and Physical Facilities Department (EPFD), led by Deputy Secretary General (DSG) Engr. Renato Dela Torre, is at the forefront of these renovations and refurbishments. \n\nDela Torre pointed out that the ongoing renovations coincides with the ongoing renovations on room assignments of new and incoming lawmakers. \n\n“It is a very hectic schedule. But we can do it. We are still prioritizing all the preparations for the SONA,” he pointed out.\n\nAmong the facilities upgraded was the audio system in the plenary hall. \n\n“Yan ang major upgrade natin this SONA. Kasi napansin natin mayroong mga dead spot na sa plenary hall area na hindi na audible (ang proceedings). Iyong configuration natin nung plenary before, parang rectangular lang siya sa gitna, nag-expand tayo sa first gallery so yung may mga portion dun na hindi na tinatamaan ng sounds, so naga-upgrade tayo. Ngayon balanse na yung tunog kahit saan kang area sa plenary hall, malinaw na,” Dela Torre said. \n\nThe gallery seats at the Plenary Hall were also replaced with new and modern ones. \n\nAccording to dela Torre, “1970s pa yung ating installation doon, so sira na yung mga mechanism nung folding chairs natin sa gallery. Ngayon bago na. In addition, mayroon na rin tayong seats na may ilaw, numbers.”\n\nThe 6x12 meter Philippine flag behind the Speaker's rostrum at the plenary hall was also cleaned and re-installed on Thursday. \n\nLandscaping works at the helipad area is also ongoing. He said landscaping at the helipad area is done as plants are already old. The landscaping is being undertaken by the Metro Manila Development Authority. \n\nOther areas improved include the Andaya Hall, the north and south lobbies, among others."
      },
      "PDF": null
    }
  },
  {
    "url": "https://www.congress.gov.ph/media/view/?content=5919&title=OP+HOSTS+FINAL+INTERAGENCY+MEETING+FOR+SONA+2025",
    "timestamp": 1753855012923,
    "data": {
      "id": "C2",
      "title": "OP HOSTS FINAL INTERAGENCY MEETING FOR SONA 2025",
      "href": "https://www.congress.gov.ph/media/view/?content=5919&title=OP+HOSTS+FINAL+INTERAGENCY+MEETING+FOR+SONA+2025",
      "content": {
        "datetime": "2025-07-15 04:40 PM",
        "article": "With less than two weeks to go before the actual day, officials of the Office of the President. (OP), House of Representatives and Senate of the Philippines met at Malacañan Palace on Tuesday to put the finishing touches on plans for President Ferdinand R. Marcos' fourth State of the Nation Address (SONA) on July 28.\n\nHouse Secretary General Reginald Velasco described this year's SONA as another opportunity to \"raise the bar even higher,\" recalling the success of the previous SONAs.\n\n\"We have a great challenge ahead of us. Over the years, we have consistently set a high standard through the effective conduct of past SONAs,\" Velasco said.\n\nTopics discussed in the meeting ranged from security plans, traffic rerouting to contingency measures to details such as the person chosen to sing the national anthem. For this year, the singer will be The Voice Season 26 winner Mr. Sofronio Vasquez. \n\nAs in previous years, zipper lanes shall be set up along Commonwealth Avenue, beginning at the Quezon Memorial Circle to the HRep Complex on July 28, beginning 9 a.m. Officials from the Metro Manila Development Authority nonetheless gave assurances that vehicle flow shall not be impeded. \n\nThe officials scheduled an ocular inspection of the House of Representatives complex on July 21 to simulate the SONA program."
      },
      "PDF": null
    }
  },
  {
    "url": "https://www.congress.gov.ph/media/view/?content=5918&title=SOLONS+WARN+VS.+%E2%80%98MISUSE%E2%80%99+OF+ONE-YEAR+BAR+RULE%2C++URGE+SENATE+TRIAL+TO+PROCEED",
    "timestamp": 1753855019804,
    "data": {
      "id": "C2",
      "title": "SOLONS WARN VS. ‘MISUSE’ OF ONE-YEAR BAR RULE,  URGE SENATE TRIAL TO PROCEED",
      "href": "https://www.congress.gov.ph/media/view/?content=5918&title=SOLONS+WARN+VS.+%E2%80%98MISUSE%E2%80%99+OF+ONE-YEAR+BAR+RULE%2C++URGE+SENATE+TRIAL+TO+PROCEED",
      "content": {
        "datetime": "2025-07-14 04:09 PM",
        "article": "News Gist\n\nReelected Manila Rep. Joel Chua and Bicol Saro Party-list Rep. Terry Ridon, in a press conference on Monday, cautioned against what they described as the possible misuse of the one-year bar rule in the ongoing impeachment case against Vice President Sara Duterte.\n\nThe lawmakers underscored that the rule which bars the filing of more than one impeachment complaint against the same official within a year should not be used to derail efforts to exact accountability from impeachable officials.\n\n“Halimbawa po kakampi po ako ng president. Every year na lang po magpa-file ako kahit walang kakwenta-kwentang impeachment para at least ma-meet ko yung one-year ban rule? Pag na-file ko na, at kung nandoon sa rule dapat paunahan, e di ita-transmit na po. So pwede po kasi itong magamit para dun sa kakampi ng kung sino man ang ipapa-impeach natin,” Chua said.\n\nRidon then argued that the petitions filed before the Supreme Court (SC) questioning the validity of the complaints against VP Duterte have no merit, particularly those invoking the one-year ban rule. He pointed out that the first three complaints never reached the House Committee on Justice.\n\n“Tingin ko ang magiging tanong ng SC ay particularly doon sa first three complaints ay, una meron bang nag-file? Nangyari na ho iyon,” he said. \n\n“Pero ang susunod which is a requirement under the Gutierrez and Francisco (Francisco v. House of Representatives and Gutierrez v. House of Representatives), nagkaroon ba ng referral to the House Committee on Justice? I think the facts are clear that there was never a referral to the House Committee on Justice on the first, on the second, and on the third complaint. So basically dapat ho mabasura po ultimately ito pong kaso na ito,” he added. \n\nDespite the pending petitions, Chua said the Senate should already proceed with the trial in the absence of a Supreme Court-issued temporary restraining order.\n\n“Wala pong dahilan para hintayin ang Senado kung ano po ang magiging desisyon ng Korte Suprema dahil wala naman pong TRO na nilalabas. So sa ngayon dapat po mag-proceed pa rin po ang trial hangga’t hindi ito pinapahinto ng Korte Suprema,\" Chua said.\n\nRidon backed this, saying that the Senate has the duty to move forward with the case. \n\n“They should not serve as a reason for the Senate impeachment court to further delay proceedings and not act on their constitutional mandate, which is to try and decide the impeachment case of VP Sara Duterte in the soonest possible time,” Ridon stated.\n\nChua also rejected claims that the SC was interfering with the impeachment process, saying the House was simply being asked to provide records.\n\n“Maliwanag naman po yung hinihingi ng SC: ito po ay parte ng pagresolba sa issue na ibinato sa kanila,” he said.\n\nBoth lawmakers said the Constitution and existing jurisprudence are clear and should not be twisted to shield public officials from accountability."
      },
      "PDF": null
    }
  },
  {
    "url": "https://www.congress.gov.ph/media/view/?content=5917&title=%27LISTENING+SESSION%27+HELD+FOR+MINDANAO+LAWMAKERS+TO+ALIGN+REGIONAL+NEEDS+WITH+NAT%27L+POLICY%0A",
    "timestamp": 1753855026740,
    "data": {
      "id": "C2",
      "title": "'LISTENING SESSION' HELD FOR MINDANAO LAWMAKERS TO ALIGN REGIONAL NEEDS WITH NAT'L POLICY",
      "href": "https://www.congress.gov.ph/media/view/?content=5917&title=%27LISTENING+SESSION%27+HELD+FOR+MINDANAO+LAWMAKERS+TO+ALIGN+REGIONAL+NEEDS+WITH+NAT%27L+POLICY%0A",
      "content": {
        "datetime": "2025-07-14 03:10 PM",
        "article": "Reelected Leyte Rep. Ferdinand Martin G. Romualdez joins a group photo with House members from Northern Mindanao, Davao and Caraga regions following the Congressional Consultative Forum on Regional Priorities held at Almont Inland Resort in Butuan City on Monday, July 14, 2025. Describing the event as a “listening session,” Romualdez emphasized the importance of aligning regional needs with national policy and reaffirmed his commitment to supporting colleagues in advancing their advocacies under the Bagong Pilipinas vision of President Ferdinand R. Marcos Jr."
      },
      "PDF": null
    }
  },
  {
    "url": "https://www.congress.gov.ph/media/view/?content=5916&title=ROMUALDEZ+HOLDS+CONSULTATIVE+MEETING+WITH+MINDANAO+SOLONS",
    "timestamp": 1753855033641,
    "data": {
      "id": "C2",
      "title": "ROMUALDEZ HOLDS CONSULTATIVE MEETING WITH MINDANAO SOLONS",
      "href": "https://www.congress.gov.ph/media/view/?content=5916&title=ROMUALDEZ+HOLDS+CONSULTATIVE+MEETING+WITH+MINDANAO+SOLONS",
      "content": {
        "datetime": "2025-07-14 03:07 PM",
        "article": "Reelected Leyte Rep. Ferdinand Martin G. Romualdez speaks before House members from Northern Mindanao, Davao and Caraga regions during the Congressional Consultative Forum on Regional Priorities held at Almont Inland Resort in Butuan City. Describing the event as a “listening session,” Romualdez emphasized the importance of aligning regional needs with national policy and reaffirmed his commitment to supporting colleagues in advancing their advocacies under the Bagong Pilipinas vision of President Ferdinand R. Marcos Jr."
      },
      "PDF": null
    }
  },
  {
    "url": "https://www.congress.gov.ph/media/view/?content=5915&title=ROMUALDEZ+UPBEAT+ABOUT+COLLECTIVE+STRENGTH+OF+INCOMING+20TH+CONGRESS%0A",
    "timestamp": 1753855040779,
    "data": {
      "id": "C2",
      "title": "ROMUALDEZ UPBEAT ABOUT COLLECTIVE STRENGTH OF INCOMING 20TH CONGRESS",
      "href": "https://www.congress.gov.ph/media/view/?content=5915&title=ROMUALDEZ+UPBEAT+ABOUT+COLLECTIVE+STRENGTH+OF+INCOMING+20TH+CONGRESS%0A",
      "content": {
        "datetime": "2025-07-10 02:31 PM",
        "article": "Reelected Leyte 1st District Rep. Ferdinand Martin G. Romualdez challenges neophyte House members of the 20th Congress to help the chamber deliver more meaningful reforms to uplift the lives of the Filipino people. In his message during a fellowship dinner held at Imelda Hall of Aguado Residence in Malacañang — tendered for the second batch of lawmakers who completed the three-day Executive Course on Legislation — Romualdez said: “With your passion, drive and fresh perspectives, I truly believe we can make this 20th Congress the most dynamic yet.”"
      },
      "PDF": null
    }
  },
  {
    "url": "https://www.congress.gov.ph/media/view/?content=5914&title=ROMUALDEZ+SHARES+SOME+ADVICE+TO+HOUSE+%E2%80%98HOTSHOTS%E2%80%99%0A",
    "timestamp": 1753855049404,
    "data": {
      "id": "C2",
      "title": "ROMUALDEZ SHARES SOME ADVICE TO HOUSE ‘HOTSHOTS’",
      "href": "https://www.congress.gov.ph/media/view/?content=5914&title=ROMUALDEZ+SHARES+SOME+ADVICE+TO+HOUSE+%E2%80%98HOTSHOTS%E2%80%99%0A",
      "content": {
        "datetime": "2025-07-10 12:16 PM",
        "article": "Reelected Leyte 1st District Rep. Ferdinand Martin G. Romualdez shares some words of wisdom to incoming young members of the 20th Congress during a dinner held at Imelda Hall of Aguado Residence in Malacañang Wednesday, July 9, 2025. With him are (from left) Reps. Andrew Julian K. Romualdez (Tingog Party-list), Javier Miguel L. Benitez (3rd District, Negros Occidental), Brian Poe-Llamanzares (FPJ Panday Bayanihan Party-list), Ryan S. Recto (6th District, Batangas) and Leandro Leviste of the 1st District, Batangas (not in the photo)."
      },
      "PDF": null
    }
  },
  {
    "url": "https://www.congress.gov.ph/media/view/?content=5912&title=VETERAN+HOUSE+LEADERS+MENTOR+NEW+SOLONS+ON+RESPONSIBLE+LAWMAKING",
    "timestamp": 1753855056308,
    "data": {
      "id": "C2",
      "title": "VETERAN HOUSE LEADERS MENTOR NEW SOLONS ON RESPONSIBLE LAWMAKING",
      "href": "https://www.congress.gov.ph/media/view/?content=5912&title=VETERAN+HOUSE+LEADERS+MENTOR+NEW+SOLONS+ON+RESPONSIBLE+LAWMAKING",
      "content": {
        "datetime": "2025-07-09 05:25 AM",
        "article": "Incoming Representatives to the 20th Congress were treated to a crash course on responsible lawmaking on the second day of the Executive Course on Legislation (ECL) Tuesday. \n\nReelected Davao de Oro Rep. Maria Carmen Zamora led the discussion on the legislative role in the national budget process. She provided an overview of the structure and flow of the national budget, explaining how Congress participates in its preparation, passage and implementation. \n\nFormer House Secretary General and current Civil Service Commission (CSC) Chairperson Marilyn Barua-Yap, reminded legislators that being a representative is not a position of privilege, but a trust granted by the people that must be exercised with humility and responsibility. \n\nShe advised attendees that they must 'be heard' and remain accountable to the people at all times, stressing that their government position demands constant transparency and integrity.\n\n\"Gagawin mo pa lang, mag-account ka na. Papaano mag-account? Report, inform. You fail if you don't report and you don't inform. You explain why you are filing this bill. You justify why you are filing this bill. Anong value nito sa tao,\" she stated. \n\nFormer Surigao del Norte Rep. Robert Ace Barbers, who chaired the House Committee on Dangerous Drugs in the 19th Congress, emphasized that committee work is the lifeblood of the legislative system. He described legislative committees as the institutional backbone of the lawmaking process.\n\n\"Much of the work are actually done in the committees. Laws are crafted in the committee level. Lahat ho ay nagsasama-sama sa committee in order to craft a legislation that would serve the common interest of the people,\" he said. \n\nBarbers also highlighted key aspects of committee operations, such as the rules on membership, attendance and the quorum needed to conduct meetings. He discussed the functions of executive sessions, the Committee of the Whole, the conduct of both regular and special meetings, while explaining how proposed measures are taken up and acted upon in committees.\n\nDepartment of Education Undersecretary Ronald Mendoza provided insights into the current state of education, underscoring key issues and areas that are in need of immediate review and reform.\n\nThe ECL was organized by the House of Representatives in partnership with the National College of Public Administration and Governance of the University of the Philippines to help incoming representatives prepare for the lawmaking process. \n\nThe 20th Congress will officially begin on July 28, 2025."
      },
      "PDF": null
    }
  },
  {
    "url": "https://www.congress.gov.ph/media/view/?content=5911&title=C.+LUZON%2C+SOUTHERN+TAGALOG+SOLONS+BARE+PRIORITY+DEV%E2%80%99T+PRIORITIES%0A",
    "timestamp": 1753855063708,
    "data": {
      "id": "C2",
      "title": "C. LUZON, SOUTHERN TAGALOG SOLONS BARE PRIORITY DEV’T PRIORITIES",
      "href": "https://www.congress.gov.ph/media/view/?content=5911&title=C.+LUZON%2C+SOUTHERN+TAGALOG+SOLONS+BARE+PRIORITY+DEV%E2%80%99T+PRIORITIES%0A",
      "content": {
        "datetime": "2025-07-08 04:52 PM",
        "article": "Reelected Leyte 1st District Rep. Ferdinand Martin G. Romualdez exhorts House members from Central Luzon and Calabarzon regions to support the Bagong Pilipinas program and legislative priorities of President Ferdinand R. Marcos Jr. that would be presented in the 20th Congress. During their meeting at Imelda Hall, Aguado Residence in Malacañang on Tuesday, July 8, 2025, he also engaged them in a cordial consultation about their local development priorities and concerns that need national support."
      },
      "PDF": null
    }
  },
  {
    "url": "https://www.congress.gov.ph/media/view/?content=5910&title=ROMUALDEZ+RALLIES+REGIONS+3%2C+4-A+LAWMAKERS+TO+SUPPORT+BAGONG+PILIPINAS%0A",
    "timestamp": 1753855070695,
    "data": {
      "id": "C2",
      "title": "ROMUALDEZ RALLIES REGIONS 3, 4-A LAWMAKERS TO SUPPORT BAGONG PILIPINAS",
      "href": "https://www.congress.gov.ph/media/view/?content=5910&title=ROMUALDEZ+RALLIES+REGIONS+3%2C+4-A+LAWMAKERS+TO+SUPPORT+BAGONG+PILIPINAS%0A",
      "content": {
        "datetime": "2025-07-08 04:38 PM",
        "article": "Reelected Leyte 1st District Rep. Ferdinand Martin G. Romualdez and lawmakers from Central Luzon (Region 3) and Calabarzon (Region 4-A) gather for a group photo during their meeting at Imelda Hall, Aguado Residence in Malacañang Tuesday, July 8, 2025. During the event, Rep. Romualdez rallied his colleagues to build consensus around President Ferdinand R. Marcos Jr.’s Bagong Pilipinas program and priority legislations for the 20th Congress."
      },
      "PDF": null
    }
  },
  {
    "url": "https://www.congress.gov.ph/media/view/?content=5909&title=74+LAWMAKERS+ATTEND+2ND+LEGISLATIVE+CRASH+COURSE%0A",
    "timestamp": 1753855077801,
    "data": {
      "id": "C2",
      "title": "74 LAWMAKERS ATTEND 2ND LEGISLATIVE CRASH COURSE",
      "href": "https://www.congress.gov.ph/media/view/?content=5909&title=74+LAWMAKERS+ATTEND+2ND+LEGISLATIVE+CRASH+COURSE%0A",
      "content": {
        "datetime": "2025-07-07 07:40 PM",
        "article": "Some 52 district representatives along with 22 party-list representatives joined the second batch of lawmakers attending the Executive Course on Legislation (ECL) at the House of Representatives Monday.\n\nThe House of Representatives developed the program in partnership with the National College of Public Administration and Governance of the University of the Philippines as a way to help lawmakers craft more responsive and effective laws, while also deepening their understanding of the legislative process and its importance in promoting national development.\n\nFormer Northern Samar Rep. Paul Ruiz Daza gave an overview of the Philippine Congress, sharing personal insights on legislative tools and privileges, priority development and public service and practical pointers for lawmakers. He also discussed public engagement, media relations and the importance of protecting the image of the institution.\n\nDaza encouraged lawmakers to consult and work closely with the committee secretariat, which he described as a vital resource given its institutional knowledge and expertise in various legislative processes.\n\n\"Everybody in Congress are good resource especially the committee secretariat. They can teach you a lot. Huwag kayong mahihiya and ask them for help,\" Daza said. \n\nFormer Deputy Majority Leader and Iloilo Rep. Lorenz Defensor delivered a lecture on how a bill becomes a law. He walked the participants through the step-by-step process — from filing a bill, committee action and plenary deliberations to voting, Senate action, and finally, action by the President.\n\nDefensor also advised lawmakers, especially first-time lawmakers, to attend plenary sessions regularly to gain hands-on experience and familiarity with the lawmaking process.\n\nHouse Secretary General Reginald Velasco lauded the commitment, energy and leadership potential of the participating lawmakers, and challenged them to take full advantage of their position to drive meaningful change and inspire others in public service.\n\n\"This is your opportunity to show them the power of effective, decisive leadership that genuinely make a real difference and enhance the lives of those you truly serve,\" he stated.\n\nVelasco assured members of the 20th Congress of the wholehearted and unwavering support of the House secretariat in fulfilling their legislative responsibilities."
      },
      "PDF": null
    }
  }
]